{
  "root": [
{
"link_name": "1.  Perceivable ",
"link_href": "#perceivable",
"section_text": "1.  Perceivable > Information and user interface components must be presentable to users in ways they can perceive. Guideline 1.1 Text Alternatives> Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language. Success Criterion 1.1.1 Non-text Content> Understanding Non-text Content | How to Meet Non-text Content(Level A). All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below. Controls, Input If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.). Time-Based Media If non-text content is time-based media, then text alternatives at least provide descriptive. identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.). Test If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text. content. Sensory If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text. content. CAPTCHA If the purpose of non-text content is to confirm that content is being accessed by. a person rather than a computer, then text alternatives that identify and describe. the purpose of the non-text content are provided, and alternative forms of CAPTCHA. using output modes for different types of sensory perception are provided to accommodate. different disabilities. Decoration, Formatting, Invisible If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented. in a way that it can be ignored by assistive technology. Guideline 1.2 Time-based Media> Provide alternatives for time-based media. Success Criterion 1.2.1 Audio-only and Video-only (Prerecorded)> Understanding Audio-only and Video-only (Prerecorded) | How to Meet Audio-only and Video-only (Prerecorded)(Level A). For prerecorded. audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:. Prerecorded Audio-only An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content. Prerecorded Video-only Either an alternative for time-based media or an audio track is provided that presents. equivalent information for prerecorded video-only content. Success Criterion 1.2.2 Captions (Prerecorded)> Understanding Captions (Prerecorded) | How to Meet Captions (Prerecorded)(Level A). Captions are provided for all prerecorded. audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such. Success Criterion 1.2.3 Audio Description or Media Alternative (Prerecorded)> Understanding Audio Description or Media Alternative (Prerecorded) | How to Meet Audio Description or Media Alternative (Prerecorded)(Level A). An alternative for time-based media or audio description of the prerecorded. video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such. Success Criterion 1.2.4 Captions (Live)> Understanding Captions (Live) | How to Meet Captions (Live)(Level AA). Captions are provided for all live. audio content in synchronized media. Success Criterion 1.2.5 Audio Description (Prerecorded)> Understanding Audio Description (Prerecorded) | How to Meet Audio Description (Prerecorded)(Level AA). Audio description is provided for all prerecorded. video content in synchronized media. Success Criterion 1.2.6 Sign Language (Prerecorded)> Understanding Sign Language (Prerecorded) | How to Meet Sign Language (Prerecorded)(Level AAA). Sign language interpretation is provided for all prerecorded. audio content in synchronized media. Success Criterion 1.2.7 Extended Audio Description (Prerecorded)> Understanding Extended Audio Description (Prerecorded) | How to Meet Extended Audio Description (Prerecorded)(Level AAA). Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded. video content in synchronized media. Success Criterion 1.2.8 Media Alternative (Prerecorded)> Understanding Media Alternative (Prerecorded) | How to Meet Media Alternative (Prerecorded)(Level AAA). An alternative for time-based media is provided for all prerecorded. synchronized media and for all prerecorded video-only media. Success Criterion 1.2.9 Audio-only (Live)> Understanding Audio-only (Live) | How to Meet Audio-only (Live)(Level AAA). An alternative for time-based media that presents equivalent information for live. audio-only content is provided.Guideline 1.3 Adaptable> Create content that can be presented in different ways (for example simpler layout) without losing information or structure. Success Criterion 1.3.1 Info and Relationships> Understanding Info and Relationships | How to Meet Info and Relationships(Level A). Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text. Success Criterion 1.3.2 Meaningful Sequence> Understanding Meaningful Sequence | How to Meet Meaningful Sequence(Level A). When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined. Success Criterion 1.3.3 Sensory Characteristics> Understanding Sensory Characteristics | How to Meet Sensory Characteristics(Level A). Instructions provided for understanding and operating content do not rely solely on. sensory characteristics of components such as shape, color, size, visual location, orientation,. or sound. NoteFor requirements related to color, refer to Guideline 1.4. Success Criterion 1.3.4 Orientation> Understanding Orientation | How to Meet Orientation(Level AA). Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential. NoteExamples where a particular display orientation may be essential are a bank check, a piano application, slides for a projector or television, or virtual reality content where binary display orientation is not applicable. Success Criterion 1.3.5 Identify Input Purpose> Understanding Identify Input Purpose | How to Meet Identify Input Purpose(Level AA). The purpose of each input field collecting information about the user can be programmatically determined when: The input field serves a purpose identified in the Input Purposes for User Interface Components section; and. The content is implemented using technologies with support for identifying the expected meaning for form input data.  Success Criterion 1.3.6 Identify Purpose> Understanding Identify Purpose | How to Meet Identify Purpose(Level AAA). In content implemented using markup languages, the purpose of User Interface Components, icons, and regions can be programmatically determined.  Guideline 1.4 Distinguishable> Make it easier for users to see and hear content including separating foreground from background. Success Criterion 1.4.1 Use of Color> Understanding Use of Color | How to Meet Use of Color(Level A). Color is not used as the only visual means of conveying information, indicating an. action, prompting a response, or distinguishing a visual element. NoteThis success criterion addresses color perception specifically. Other forms of perception are covered in Guideline 1.3 including programmatic access to color and other visual presentation coding. Success Criterion 1.4.2 Audio Control> Understanding Audio Control | How to Meet Audio Control(Level A). If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio. volume independently from the overall system volume level. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether or not it is used. to meet other success criteria) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 1.4.3 Contrast (Minimum)> Understanding Contrast (Minimum) | How to Meet Contrast (Minimum)(Level AA). The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement.  . Success Criterion 1.4.4 Resize text> Understanding Resize text | How to Meet Resize text(Level AA). Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality. Success Criterion 1.4.5 Images of Text> Understanding Images of Text | How to Meet Images of Text(Level AA). If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:. Customizable The image of text can be visually customized to the user's requirements;. Essential A particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. Success Criterion 1.4.6 Contrast (Enhanced)> Understanding Contrast (Enhanced) | How to Meet Contrast (Enhanced)(Level AAA). The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement.  . Success Criterion 1.4.7 Low or No Background Audio> Understanding Low or No Background Audio | How to Meet Low or No Background Audio(Level AAA). For prerecorded. audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio. CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression. such as singing or rapping, at least one of the following is true:. No Background The audio does not contain background sounds. Turn Off The background sounds can be turned off. 20 dB The background sounds are at least 20 decibels lower than the foreground speech content,. with the exception of occasional sounds that last for only one or two seconds. NotePer the definition of decibel, background sound that meets this requirement will. be approximately four times quieter than the foreground speech content. Success Criterion 1.4.8 Visual Presentation> Understanding Visual Presentation | How to Meet Visual Presentation(Level AAA). For the visual presentation of blocks of text, a mechanism is available to achieve the following:. Foreground and background colors can be selected by the user. Width is no more than 80 characters or glyphs (40 if CJK). Text is not justified (aligned to both the left and the right margins). Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing. Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window.  Success Criterion 1.4.9 Images of Text (No Exception)> Understanding Images of Text (No Exception) | How to Meet Images of Text (No Exception)(Level AAA). Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. Success Criterion 1.4.10 Reflow> Understanding Reflow | How to Meet Reflow(Level AA). Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for: Vertical scrolling content at a width equivalent to 320 CSS pixels;. Horizontal scrolling content at a height equivalent to 256 CSS pixels. Except for parts of the content which require two-dimensional layout for usage or meaning. NoteNote: 320 CSS pixels is equivalent to a starting viewport width of 1280 CSS pixels wide at 400% zoom. For web content which are designed to scroll horizontally (e.g. with vertical text), the 256 CSS pixels is equivalent to a starting viewport height of 1024px at 400% zoom. NoteExamples of content which require two-dimensional layout are images, maps, diagrams, .video, games, presentations, data tables, and interfaces where it is necessary to keep toolbars in view while.manipulating content. Success Criterion 1.4.11 Non-text Contrast> Understanding Non-text Contrast | How to Meet Non-text Contrast(Level AA). The visual presentation of the following have a contrast ratio of at least 3:1 against adjacent color(s): User Interface Components. Visual information required to identify user interface components and states, except for inactive components or where the appearance of the component is determined by the user agent and not modified by the author;. Graphical Objects. Parts of graphics required to understand the content, except when a particular presentation of graphics is essential to the information being conveyed.  Success Criterion 1.4.12 Text Spacing> Understanding Text Spacing | How to Meet Text Spacing(Level AA). In content implemented using markup languages that support the following text style properties, no loss of content or functionality occurs by setting all of the following and by changing no other style property: Line height (line spacing) to at least 1.5 times the font size;. Spacing following paragraphs to at least 2 times the font size;. Letter spacing (tracking) to at least 0.12 times the font size;. Word spacing to at least 0.16 times the font size. Exception: Human languages and scripts that do not make use of one or more of these text style properties in written text can conform using only the properties that exist for that combination of language and script. Success Criterion 1.4.13 Content on Hover or Focus> Understanding Content on Hover or Focus | How to Meet Content on Hover or Focus(Level AA). Where receiving and then removing pointer hover or keyboard focus triggers additional content to become visible and then hidden, the following are true: Dismissable. A mechanism is available to dismiss the additional content without moving pointer hover or keyboard focus, unless the additional content communicates an input error or does not obscure or replace other content;. Hoverable. If pointer hover can trigger the additional content, then the pointer can be moved  over the additional content without the additional content disappearing;. Persistent. The additional content remains visible until the hover or focus trigger is removed, the user dismisses it, or its information is no longer valid. Exception: The visual presentation of the additional content is controlled by the user agent and is not modified by the author. NoteExamples of additional content controlled by the user agent include browser tooltips created through use of the HTML title attribute. NoteCustom tooltips, sub-menus, and other nonmodal popups that display on hover and focus are examples of additional content covered by this criterion. ",
"children": [
  {
"link_name": "1.1 Text Alternatives",
"link_href": "#text-alternatives",
"section_text": "Guideline 1.1 Text Alternatives> Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language. Success Criterion 1.1.1 Non-text Content> Understanding Non-text Content | How to Meet Non-text Content(Level A). All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below. Controls, Input If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.). Time-Based Media If non-text content is time-based media, then text alternatives at least provide descriptive. identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.). Test If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text. content. Sensory If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text. content. CAPTCHA If the purpose of non-text content is to confirm that content is being accessed by. a person rather than a computer, then text alternatives that identify and describe. the purpose of the non-text content are provided, and alternative forms of CAPTCHA. using output modes for different types of sensory perception are provided to accommodate. different disabilities. Decoration, Formatting, Invisible If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented. in a way that it can be ignored by assistive technology.",
"children": [
{
  "link_name": "1.1.1 Non-text Content",
  "link_href": "#non-text-content",
  "section_text": "Success Criterion 1.1.1 Non-text Content> Understanding Non-text Content | How to Meet Non-text Content(Level A). All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below. Controls, Input If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.). Time-Based Media If non-text content is time-based media, then text alternatives at least provide descriptive. identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.). Test If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text. content. Sensory If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text. content. CAPTCHA If the purpose of non-text content is to confirm that content is being accessed by. a person rather than a computer, then text alternatives that identify and describe. the purpose of the non-text content are provided, and alternative forms of CAPTCHA. using output modes for different types of sensory perception are provided to accommodate. different disabilities. Decoration, Formatting, Invisible If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented. in a way that it can be ignored by assistive technology. ",
  "children": [],
  "secno": "1.1.1 ",
  "depth": 2
}
],
"secno": "1.1 ",
"depth": 1
  },
  {
"link_name": "1.2 Time-based Media",
"link_href": "#time-based-media",
"section_text": "Guideline 1.2 Time-based Media> Provide alternatives for time-based media. Success Criterion 1.2.1 Audio-only and Video-only (Prerecorded)> Understanding Audio-only and Video-only (Prerecorded) | How to Meet Audio-only and Video-only (Prerecorded)(Level A). For prerecorded. audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:. Prerecorded Audio-only An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content. Prerecorded Video-only Either an alternative for time-based media or an audio track is provided that presents. equivalent information for prerecorded video-only content. Success Criterion 1.2.2 Captions (Prerecorded)> Understanding Captions (Prerecorded) | How to Meet Captions (Prerecorded)(Level A). Captions are provided for all prerecorded. audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such. Success Criterion 1.2.3 Audio Description or Media Alternative (Prerecorded)> Understanding Audio Description or Media Alternative (Prerecorded) | How to Meet Audio Description or Media Alternative (Prerecorded)(Level A). An alternative for time-based media or audio description of the prerecorded. video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such. Success Criterion 1.2.4 Captions (Live)> Understanding Captions (Live) | How to Meet Captions (Live)(Level AA). Captions are provided for all live. audio content in synchronized media. Success Criterion 1.2.5 Audio Description (Prerecorded)> Understanding Audio Description (Prerecorded) | How to Meet Audio Description (Prerecorded)(Level AA). Audio description is provided for all prerecorded. video content in synchronized media. Success Criterion 1.2.6 Sign Language (Prerecorded)> Understanding Sign Language (Prerecorded) | How to Meet Sign Language (Prerecorded)(Level AAA). Sign language interpretation is provided for all prerecorded. audio content in synchronized media. Success Criterion 1.2.7 Extended Audio Description (Prerecorded)> Understanding Extended Audio Description (Prerecorded) | How to Meet Extended Audio Description (Prerecorded)(Level AAA). Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded. video content in synchronized media. Success Criterion 1.2.8 Media Alternative (Prerecorded)> Understanding Media Alternative (Prerecorded) | How to Meet Media Alternative (Prerecorded)(Level AAA). An alternative for time-based media is provided for all prerecorded. synchronized media and for all prerecorded video-only media. Success Criterion 1.2.9 Audio-only (Live)> Understanding Audio-only (Live) | How to Meet Audio-only (Live)(Level AAA). An alternative for time-based media that presents equivalent information for live. audio-only content is provided. ",
"children": [
{
  "link_name": "1.2.1 Audio-only and Video-only (Prerecorded)",
  "link_href": "#audio-only-and-video-only-prerecorded",
  "section_text": "Success Criterion 1.2.1 Audio-only and Video-only (Prerecorded)> Understanding Audio-only and Video-only (Prerecorded) | How to Meet Audio-only and Video-only (Prerecorded)(Level A). For prerecorded. audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:. Prerecorded Audio-only An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content. Prerecorded Video-only Either an alternative for time-based media or an audio track is provided that presents. equivalent information for prerecorded video-only content. ",
  "children": [],
  "secno": "1.2.1 ",
  "depth": 2
},
{
  "link_name": "1.2.2 Captions (Prerecorded)",
  "link_href": "#captions-prerecorded",
  "section_text": "Success Criterion 1.2.2 Captions (Prerecorded)> Understanding Captions (Prerecorded) | How to Meet Captions (Prerecorded)(Level A). Captions are provided for all prerecorded. audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such. ",
  "children": [],
  "secno": "1.2.2 ",
  "depth": 2
},
{
  "link_name": "1.2.3 Audio Description or Media Alternative (Prerecorded)",
  "link_href": "#audio-description-or-media-alternative-prerecorded",
  "section_text": "Success Criterion 1.2.3 Audio Description or Media Alternative (Prerecorded)> Understanding Audio Description or Media Alternative (Prerecorded) | How to Meet Audio Description or Media Alternative (Prerecorded)(Level A). An alternative for time-based media or audio description of the prerecorded. video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such. ",
  "children": [],
  "secno": "1.2.3 ",
  "depth": 2
},
{
  "link_name": "1.2.4 Captions (Live)",
  "link_href": "#captions-live",
  "section_text": "Success Criterion 1.2.4 Captions (Live)> Understanding Captions (Live) | How to Meet Captions (Live)(Level AA). Captions are provided for all live. audio content in synchronized media. ",
  "children": [],
  "secno": "1.2.4 ",
  "depth": 2
},
{
  "link_name": "1.2.5 Audio Description (Prerecorded)",
  "link_href": "#audio-description-prerecorded",
  "section_text": "Success Criterion 1.2.5 Audio Description (Prerecorded)> Understanding Audio Description (Prerecorded) | How to Meet Audio Description (Prerecorded)(Level AA). Audio description is provided for all prerecorded. video content in synchronized media. ",
  "children": [],
  "secno": "1.2.5 ",
  "depth": 2
},
{
  "link_name": "1.2.6 Sign Language (Prerecorded)",
  "link_href": "#sign-language-prerecorded",
  "section_text": "Success Criterion 1.2.6 Sign Language (Prerecorded)> Understanding Sign Language (Prerecorded) | How to Meet Sign Language (Prerecorded)(Level AAA). Sign language interpretation is provided for all prerecorded. audio content in synchronized media. ",
  "children": [],
  "secno": "1.2.6 ",
  "depth": 2
},
{
  "link_name": "1.2.7 Extended Audio Description (Prerecorded)",
  "link_href": "#extended-audio-description-prerecorded",
  "section_text": "Success Criterion 1.2.7 Extended Audio Description (Prerecorded)> Understanding Extended Audio Description (Prerecorded) | How to Meet Extended Audio Description (Prerecorded)(Level AAA). Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded. video content in synchronized media. ",
  "children": [],
  "secno": "1.2.7 ",
  "depth": 2
},
{
  "link_name": "1.2.8 Media Alternative (Prerecorded)",
  "link_href": "#media-alternative-prerecorded",
  "section_text": "Success Criterion 1.2.8 Media Alternative (Prerecorded)> Understanding Media Alternative (Prerecorded) | How to Meet Media Alternative (Prerecorded)(Level AAA). An alternative for time-based media is provided for all prerecorded. synchronized media and for all prerecorded video-only media. ",
  "children": [],
  "secno": "1.2.8 ",
  "depth": 2
},
{
  "link_name": "1.2.9 Audio-only (Live)",
  "link_href": "#audio-only-live",
  "section_text": "Success Criterion 1.2.9 Audio-only (Live)> Understanding Audio-only (Live) | How to Meet Audio-only (Live)(Level AAA). An alternative for time-based media that presents equivalent information for live. audio-only content is provided. ",
  "children": [],
  "secno": "1.2.9 ",
  "depth": 2
}
],
"secno": "1.2 ",
"depth": 1
  },
  {
"link_name": "1.3 Adaptable",
"link_href": "#adaptable",
"section_text": "Guideline 1.3 Adaptable> Create content that can be presented in different ways (for example simpler layout) without losing information or structure. Success Criterion 1.3.1 Info and Relationships> Understanding Info and Relationships | How to Meet Info and Relationships(Level A). Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text. Success Criterion 1.3.2 Meaningful Sequence> Understanding Meaningful Sequence | How to Meet Meaningful Sequence(Level A). When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined. Success Criterion 1.3.3 Sensory Characteristics> Understanding Sensory Characteristics | How to Meet Sensory Characteristics(Level A). Instructions provided for understanding and operating content do not rely solely on. sensory characteristics of components such as shape, color, size, visual location, orientation,. or sound. NoteFor requirements related to color, refer to Guideline 1.4. Success Criterion 1.3.4 Orientation> Understanding Orientation | How to Meet Orientation(Level AA). Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential. NoteExamples where a particular display orientation may be essential are a bank check, a piano application, slides for a projector or television, or virtual reality content where binary display orientation is not applicable. Success Criterion 1.3.5 Identify Input Purpose> Understanding Identify Input Purpose | How to Meet Identify Input Purpose(Level AA). The purpose of each input field collecting information about the user can be programmatically determined when: The input field serves a purpose identified in the Input Purposes for User Interface Components section; and. The content is implemented using technologies with support for identifying the expected meaning for form input data.  Success Criterion 1.3.6 Identify Purpose> Understanding Identify Purpose | How to Meet Identify Purpose(Level AAA). In content implemented using markup languages, the purpose of User Interface Components, icons, and regions can be programmatically determined. ",
"children": [
{
  "link_name": "1.3.1 Info and Relationships",
  "link_href": "#info-and-relationships",
  "section_text": "Success Criterion 1.3.1 Info and Relationships> Understanding Info and Relationships | How to Meet Info and Relationships(Level A). Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text. ",
  "children": [],
  "secno": "1.3.1 ",
  "depth": 2
},
{
  "link_name": "1.3.2 Meaningful Sequence",
  "link_href": "#meaningful-sequence",
  "section_text": "Success Criterion 1.3.2 Meaningful Sequence> Understanding Meaningful Sequence | How to Meet Meaningful Sequence(Level A). When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined. ",
  "children": [],
  "secno": "1.3.2 ",
  "depth": 2
},
{
  "link_name": "1.3.3 Sensory Characteristics",
  "link_href": "#sensory-characteristics",
  "section_text": "Success Criterion 1.3.3 Sensory Characteristics> Understanding Sensory Characteristics | How to Meet Sensory Characteristics(Level A). Instructions provided for understanding and operating content do not rely solely on. sensory characteristics of components such as shape, color, size, visual location, orientation,. or sound. NoteFor requirements related to color, refer to Guideline 1.4. ",
  "children": [],
  "secno": "1.3.3 ",
  "depth": 2
},
{
  "link_name": "1.3.4 Orientation",
  "link_href": "#orientation",
  "section_text": "Success Criterion 1.3.4 Orientation> Understanding Orientation | How to Meet Orientation(Level AA). Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential. NoteExamples where a particular display orientation may be essential are a bank check, a piano application, slides for a projector or television, or virtual reality content where binary display orientation is not applicable. ",
  "children": [],
  "secno": "1.3.4 ",
  "depth": 2
},
{
  "link_name": "1.3.5 Identify Input Purpose",
  "link_href": "#identify-input-purpose",
  "section_text": "Success Criterion 1.3.5 Identify Input Purpose> Understanding Identify Input Purpose | How to Meet Identify Input Purpose(Level AA). The purpose of each input field collecting information about the user can be programmatically determined when: The input field serves a purpose identified in the Input Purposes for User Interface Components section; and. The content is implemented using technologies with support for identifying the expected meaning for form input data. ",
  "children": [],
  "secno": "1.3.5 ",
  "depth": 2
},
{
  "link_name": "1.3.6 Identify Purpose",
  "link_href": "#identify-purpose",
  "section_text": "Success Criterion 1.3.6 Identify Purpose> Understanding Identify Purpose | How to Meet Identify Purpose(Level AAA). In content implemented using markup languages, the purpose of User Interface Components, icons, and regions can be programmatically determined. ",
  "children": [],
  "secno": "1.3.6 ",
  "depth": 2
}
],
"secno": "1.3 ",
"depth": 1
  },
  {
"link_name": "1.4 Distinguishable",
"link_href": "#distinguishable",
"section_text": "Guideline 1.4 Distinguishable> Make it easier for users to see and hear content including separating foreground from background. Success Criterion 1.4.1 Use of Color> Understanding Use of Color | How to Meet Use of Color(Level A). Color is not used as the only visual means of conveying information, indicating an. action, prompting a response, or distinguishing a visual element. NoteThis success criterion addresses color perception specifically. Other forms of perception are covered in Guideline 1.3 including programmatic access to color and other visual presentation coding. Success Criterion 1.4.2 Audio Control> Understanding Audio Control | How to Meet Audio Control(Level A). If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio. volume independently from the overall system volume level. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether or not it is used. to meet other success criteria) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 1.4.3 Contrast (Minimum)> Understanding Contrast (Minimum) | How to Meet Contrast (Minimum)(Level AA). The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement.  . Success Criterion 1.4.4 Resize text> Understanding Resize text | How to Meet Resize text(Level AA). Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality. Success Criterion 1.4.5 Images of Text> Understanding Images of Text | How to Meet Images of Text(Level AA). If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:. Customizable The image of text can be visually customized to the user's requirements;. Essential A particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. Success Criterion 1.4.6 Contrast (Enhanced)> Understanding Contrast (Enhanced) | How to Meet Contrast (Enhanced)(Level AAA). The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement.  . Success Criterion 1.4.7 Low or No Background Audio> Understanding Low or No Background Audio | How to Meet Low or No Background Audio(Level AAA). For prerecorded. audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio. CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression. such as singing or rapping, at least one of the following is true:. No Background The audio does not contain background sounds. Turn Off The background sounds can be turned off. 20 dB The background sounds are at least 20 decibels lower than the foreground speech content,. with the exception of occasional sounds that last for only one or two seconds. NotePer the definition of decibel, background sound that meets this requirement will. be approximately four times quieter than the foreground speech content. Success Criterion 1.4.8 Visual Presentation> Understanding Visual Presentation | How to Meet Visual Presentation(Level AAA). For the visual presentation of blocks of text, a mechanism is available to achieve the following:. Foreground and background colors can be selected by the user. Width is no more than 80 characters or glyphs (40 if CJK). Text is not justified (aligned to both the left and the right margins). Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing. Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window.  Success Criterion 1.4.9 Images of Text (No Exception)> Understanding Images of Text (No Exception) | How to Meet Images of Text (No Exception)(Level AAA). Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. Success Criterion 1.4.10 Reflow> Understanding Reflow | How to Meet Reflow(Level AA). Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for: Vertical scrolling content at a width equivalent to 320 CSS pixels;. Horizontal scrolling content at a height equivalent to 256 CSS pixels. Except for parts of the content which require two-dimensional layout for usage or meaning. NoteNote: 320 CSS pixels is equivalent to a starting viewport width of 1280 CSS pixels wide at 400% zoom. For web content which are designed to scroll horizontally (e.g. with vertical text), the 256 CSS pixels is equivalent to a starting viewport height of 1024px at 400% zoom. NoteExamples of content which require two-dimensional layout are images, maps, diagrams, .video, games, presentations, data tables, and interfaces where it is necessary to keep toolbars in view while.manipulating content. Success Criterion 1.4.11 Non-text Contrast> Understanding Non-text Contrast | How to Meet Non-text Contrast(Level AA). The visual presentation of the following have a contrast ratio of at least 3:1 against adjacent color(s): User Interface Components. Visual information required to identify user interface components and states, except for inactive components or where the appearance of the component is determined by the user agent and not modified by the author;. Graphical Objects. Parts of graphics required to understand the content, except when a particular presentation of graphics is essential to the information being conveyed.  Success Criterion 1.4.12 Text Spacing> Understanding Text Spacing | How to Meet Text Spacing(Level AA). In content implemented using markup languages that support the following text style properties, no loss of content or functionality occurs by setting all of the following and by changing no other style property: Line height (line spacing) to at least 1.5 times the font size;. Spacing following paragraphs to at least 2 times the font size;. Letter spacing (tracking) to at least 0.12 times the font size;. Word spacing to at least 0.16 times the font size. Exception: Human languages and scripts that do not make use of one or more of these text style properties in written text can conform using only the properties that exist for that combination of language and script. Success Criterion 1.4.13 Content on Hover or Focus> Understanding Content on Hover or Focus | How to Meet Content on Hover or Focus(Level AA). Where receiving and then removing pointer hover or keyboard focus triggers additional content to become visible and then hidden, the following are true: Dismissable. A mechanism is available to dismiss the additional content without moving pointer hover or keyboard focus, unless the additional content communicates an input error or does not obscure or replace other content;. Hoverable. If pointer hover can trigger the additional content, then the pointer can be moved  over the additional content without the additional content disappearing;. Persistent. The additional content remains visible until the hover or focus trigger is removed, the user dismisses it, or its information is no longer valid. Exception: The visual presentation of the additional content is controlled by the user agent and is not modified by the author. NoteExamples of additional content controlled by the user agent include browser tooltips created through use of the HTML title attribute. NoteCustom tooltips, sub-menus, and other nonmodal popups that display on hover and focus are examples of additional content covered by this criterion. ",
"children": [
{
  "link_name": "1.4.1 Use of Color",
  "link_href": "#use-of-color",
  "section_text": "Success Criterion 1.4.1 Use of Color> Understanding Use of Color | How to Meet Use of Color(Level A). Color is not used as the only visual means of conveying information, indicating an. action, prompting a response, or distinguishing a visual element. NoteThis success criterion addresses color perception specifically. Other forms of perception are covered in Guideline 1.3 including programmatic access to color and other visual presentation coding. ",
  "children": [],
  "secno": "1.4.1 ",
  "depth": 2
},
{
  "link_name": "1.4.2 Audio Control",
  "link_href": "#audio-control",
  "section_text": "Success Criterion 1.4.2 Audio Control> Understanding Audio Control | How to Meet Audio Control(Level A). If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio. volume independently from the overall system volume level. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether or not it is used. to meet other success criteria) must meet this success criterion. See Conformance Requirement 5: Non-Interference. ",
  "children": [],
  "secno": "1.4.2 ",
  "depth": 2
},
{
  "link_name": "1.4.3 Contrast (Minimum)",
  "link_href": "#contrast-minimum",
  "section_text": "Success Criterion 1.4.3 Contrast (Minimum)> Understanding Contrast (Minimum) | How to Meet Contrast (Minimum)(Level AA). The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement. ",
  "children": [],
  "secno": "1.4.3 ",
  "depth": 2
},
{
  "link_name": "1.4.4 Resize text",
  "link_href": "#resize-text",
  "section_text": "Success Criterion 1.4.4 Resize text> Understanding Resize text | How to Meet Resize text(Level AA). Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality. ",
  "children": [],
  "secno": "1.4.4 ",
  "depth": 2
},
{
  "link_name": "1.4.5 Images of Text",
  "link_href": "#images-of-text",
  "section_text": "Success Criterion 1.4.5 Images of Text> Understanding Images of Text | How to Meet Images of Text(Level AA). If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:. Customizable The image of text can be visually customized to the user's requirements;. Essential A particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. ",
  "children": [],
  "secno": "1.4.5 ",
  "depth": 2
},
{
  "link_name": "1.4.6 Contrast (Enhanced)",
  "link_href": "#contrast-enhanced",
  "section_text": "Success Criterion 1.4.6 Contrast (Enhanced)> Understanding Contrast (Enhanced) | How to Meet Contrast (Enhanced)(Level AAA). The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:. Large Text Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;. Incidental Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant. other visual content, have no contrast requirement. Logotypes Text that is part of a logo or brand name has no contrast requirement. ",
  "children": [],
  "secno": "1.4.6 ",
  "depth": 2
},
{
  "link_name": "1.4.7 Low or No Background Audio",
  "link_href": "#low-or-no-background-audio",
  "section_text": "Success Criterion 1.4.7 Low or No Background Audio> Understanding Low or No Background Audio | How to Meet Low or No Background Audio(Level AAA). For prerecorded. audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio. CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression. such as singing or rapping, at least one of the following is true:. No Background The audio does not contain background sounds. Turn Off The background sounds can be turned off. 20 dB The background sounds are at least 20 decibels lower than the foreground speech content,. with the exception of occasional sounds that last for only one or two seconds. NotePer the definition of decibel, background sound that meets this requirement will. be approximately four times quieter than the foreground speech content. ",
  "children": [],
  "secno": "1.4.7 ",
  "depth": 2
},
{
  "link_name": "1.4.8 Visual Presentation",
  "link_href": "#visual-presentation",
  "section_text": "Success Criterion 1.4.8 Visual Presentation> Understanding Visual Presentation | How to Meet Visual Presentation(Level AAA). For the visual presentation of blocks of text, a mechanism is available to achieve the following:. Foreground and background colors can be selected by the user. Width is no more than 80 characters or glyphs (40 if CJK). Text is not justified (aligned to both the left and the right margins). Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing. Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window. ",
  "children": [],
  "secno": "1.4.8 ",
  "depth": 2
},
{
  "link_name": "1.4.9 Images of Text (No Exception)",
  "link_href": "#images-of-text-no-exception",
  "section_text": "Success Criterion 1.4.9 Images of Text (No Exception)> Understanding Images of Text (No Exception) | How to Meet Images of Text (No Exception)(Level AAA). Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed. NoteLogotypes (text that is part of a logo or brand name) are considered essential. ",
  "children": [],
  "secno": "1.4.9 ",
  "depth": 2
},
{
  "link_name": "1.4.10 Reflow",
  "link_href": "#reflow",
  "section_text": "Success Criterion 1.4.10 Reflow> Understanding Reflow | How to Meet Reflow(Level AA). Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for: Vertical scrolling content at a width equivalent to 320 CSS pixels;. Horizontal scrolling content at a height equivalent to 256 CSS pixels. Except for parts of the content which require two-dimensional layout for usage or meaning. NoteNote: 320 CSS pixels is equivalent to a starting viewport width of 1280 CSS pixels wide at 400% zoom. For web content which are designed to scroll horizontally (e.g. with vertical text), the 256 CSS pixels is equivalent to a starting viewport height of 1024px at 400% zoom. NoteExamples of content which require two-dimensional layout are images, maps, diagrams, .video, games, presentations, data tables, and interfaces where it is necessary to keep toolbars in view while.manipulating content. ",
  "children": [],
  "secno": "1.4.10 ",
  "depth": 2
},
{
  "link_name": "1.4.11 Non-text Contrast",
  "link_href": "#non-text-contrast",
  "section_text": "Success Criterion 1.4.11 Non-text Contrast> Understanding Non-text Contrast | How to Meet Non-text Contrast(Level AA). The visual presentation of the following have a contrast ratio of at least 3:1 against adjacent color(s): User Interface Components. Visual information required to identify user interface components and states, except for inactive components or where the appearance of the component is determined by the user agent and not modified by the author;. Graphical Objects. Parts of graphics required to understand the content, except when a particular presentation of graphics is essential to the information being conveyed. ",
  "children": [],
  "secno": "1.4.11 ",
  "depth": 2
},
{
  "link_name": "1.4.12 Text Spacing",
  "link_href": "#text-spacing",
  "section_text": "Success Criterion 1.4.12 Text Spacing> Understanding Text Spacing | How to Meet Text Spacing(Level AA). In content implemented using markup languages that support the following text style properties, no loss of content or functionality occurs by setting all of the following and by changing no other style property: Line height (line spacing) to at least 1.5 times the font size;. Spacing following paragraphs to at least 2 times the font size;. Letter spacing (tracking) to at least 0.12 times the font size;. Word spacing to at least 0.16 times the font size. Exception: Human languages and scripts that do not make use of one or more of these text style properties in written text can conform using only the properties that exist for that combination of language and script. ",
  "children": [],
  "secno": "1.4.12 ",
  "depth": 2
},
{
  "link_name": "1.4.13 Content on Hover or Focus",
  "link_href": "#content-on-hover-or-focus",
  "section_text": "Success Criterion 1.4.13 Content on Hover or Focus> Understanding Content on Hover or Focus | How to Meet Content on Hover or Focus(Level AA). Where receiving and then removing pointer hover or keyboard focus triggers additional content to become visible and then hidden, the following are true: Dismissable. A mechanism is available to dismiss the additional content without moving pointer hover or keyboard focus, unless the additional content communicates an input error or does not obscure or replace other content;. Hoverable. If pointer hover can trigger the additional content, then the pointer can be moved  over the additional content without the additional content disappearing;. Persistent. The additional content remains visible until the hover or focus trigger is removed, the user dismisses it, or its information is no longer valid. Exception: The visual presentation of the additional content is controlled by the user agent and is not modified by the author. NoteExamples of additional content controlled by the user agent include browser tooltips created through use of the HTML title attribute. NoteCustom tooltips, sub-menus, and other nonmodal popups that display on hover and focus are examples of additional content covered by this criterion. ",
  "children": [],
  "secno": "1.4.13 ",
  "depth": 2
}
],
"secno": "1.4 ",
"depth": 1
  }
],
"secno": "1. ",
"depth": 0
},
{
"link_name": "2. Operable ",
"link_href": "#operable",
"section_text": "2. Operable > User interface components and navigation must be operable. Guideline 2.1 Keyboard Accessible> Make all functionality available from a keyboard. Success Criterion 2.1.1 Keyboard> Understanding Keyboard | How to Meet Keyboard(Level A). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying. function requires input that depends on the path of the user's movement and not just. the endpoints. NoteThis exception relates to the underlying function, not the input technique. For example,. if using handwriting to enter text, the input technique (handwriting) requires path-dependent. input but the underlying function (text input) does not. NoteThis does not forbid and should not discourage providing mouse input or other input. methods in addition to keyboard operation. Success Criterion 2.1.2 No Keyboard Trap> Understanding No Keyboard Trap | How to Meet No Keyboard Trap(Level A). If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface,. and, if it requires more than unmodified arrow or tab keys or other standard exit. methods, the user is advised of the method for moving focus away. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 2.1.3 Keyboard (No Exception)> Understanding Keyboard (No Exception) | How to Meet Keyboard (No Exception)(Level AAA). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes. Success Criterion 2.1.4 Character Key Shortcuts> Understanding Character Key Shortcuts | How to Meet Character Key Shortcuts(Level A). If a keyboard shortcut is implemented in content using only letter (including upper- and lower-case letters), punctuation, number, or symbol characters, then at least one of the following is true: Turn off. A mechanism is available to turn the shortcut off;. Remap. A mechanism is available to remap the shortcut to use one or more non-printable keyboard characters (e.g. Ctrl, Alt, etc);. Active only on focus. The keyboard shortcut for a user interface component is only active when that component has focus.  . Guideline 2.2 Enough Time> Provide users enough time to read and use content. Success Criterion 2.2.1 Timing Adjustable> Understanding Timing Adjustable | How to Meet Timing Adjustable(Level A). For each time limit that is set by the content, at least one of the following is true: Turn off The user is allowed to turn off the time limit before encountering it; or Adjust The user is allowed to adjust the time limit before encountering it over a wide range. that is at least ten times the length of the default setting; or. Extend The user is warned before time expires and given at least 20 seconds to extend the. time limit with a simple action (for example, press the space bar), and the user. is allowed to extend the time limit at least ten times; or. Real-time Exception The time limit is a required part of a real-time event (for example, an auction),. and no alternative to the time limit is possible; or. Essential Exception The time limit is essential and extending it would invalidate the activity; or. 20 Hour Exception The time limit is longer than 20 hours. NoteThis success criterion helps ensure that users can complete tasks without unexpected. changes in content or context that are a result of a time limit. This success criterion. should be considered in conjunction with Success Criterion 3.2.1, which puts limits on changes of content or context as a result of user action. Success Criterion 2.2.2 Pause, Stop, Hide> Understanding Pause, Stop, Hide | How to Meet Pause, Stop, Hide(Level A). For moving, blinking, scrolling, or auto-updating information, all of the following are true:. Moving, blinking, scrolling For any moving, blinking or scrolling information that (1) starts automatically, (2). lasts more than five seconds, and (3) is presented in parallel with other content,. there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity. where it is essential; and. Auto-updating For any auto-updating information that (1) starts automatically and (2) is presented. in parallel with other content, there is a mechanism for the user to pause, stop,. or hide it or to control the frequency of the update unless the auto-updating is part. of an activity where it is essential. NoteFor requirements related to flickering or flashing content, refer to Guideline 2.3. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. NoteContent that is updated periodically by software or that is streamed to the user agent. is not required to preserve or present information that is generated or received between. the initiation of the pause and resuming presentation, as this may not be technically. possible, and in many situations could be misleading to do so. NoteAn animation that occurs as part of a preload phase or similar situation can be considered. essential if interaction cannot occur during that phase for all users and if not indicating. progress could confuse users or cause them to think that content was frozen or broken. Success Criterion 2.2.3 No Timing> Understanding No Timing | How to Meet No Timing(Level AAA). Timing is not an essential part of the event or activity presented by the content, except for non-interactive. synchronized media and real-time events. Success Criterion 2.2.4 Interruptions> Understanding Interruptions | How to Meet Interruptions(Level AAA). Interruptions can be postponed or suppressed by the user, except interruptions involving. an emergency. Success Criterion 2.2.5 Re-authenticating> Understanding Re-authenticating | How to Meet Re-authenticating(Level AAA). When an authenticated session expires, the user can continue the activity without. loss of data after re-authenticating. Success Criterion 2.2.6 Timeouts> Understanding Timeouts | How to Meet Timeouts(Level AAA). Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions. NotePrivacy regulations may require explicit user consent before user identification has been authenticated and before user data is preserved. In cases where the user is a minor, explicit consent may not be solicited in most jurisdictions, countries or regions. Consultation with privacy professionals and legal counsel is advised when considering data preservation as an approach to satisfy this success criterion.  Guideline 2.3 Seizures and Physical Reactions> Do not design content in a way that is known to cause seizures or physical reactions. Success Criterion 2.3.1 Three Flashes or Below Threshold> Understanding Three Flashes or Below Threshold | How to Meet Three Flashes or Below Threshold(Level A). Web pages do not contain anything that flashes more than three times in any one second period,. or the flash is below the general flash and red flash thresholds. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 2.3.2 Three Flashes> Understanding Three Flashes | How to Meet Three Flashes(Level AAA). Web pages do not contain anything that flashes more than three times in any one second period. Success Criterion 2.3.3 Animation from Interactions> Understanding Animation from Interactions | How to Meet Animation from Interactions(Level AAA). Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed.  Guideline 2.4 Navigable> Provide ways to help users navigate, find content, and determine where they are. Success Criterion 2.4.1 Bypass Blocks> Understanding Bypass Blocks | How to Meet Bypass Blocks(Level A). A mechanism is available to bypass blocks of content that are repeated on multiple Web pages. Success Criterion 2.4.2 Page Titled> Understanding Page Titled | How to Meet Page Titled(Level A). Web pages have titles that describe topic or purpose. Success Criterion 2.4.3 Focus Order> Understanding Focus Order | How to Meet Focus Order(Level A). If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive. focus in an order that preserves meaning and operability. Success Criterion 2.4.4 Link Purpose (In Context)> Understanding Link Purpose (In Context) | How to Meet Link Purpose (In Context)(Level A). The purpose of each link can be determined from the link text alone or from the link text together with its. programmatically determined link context, except where the purpose of the link would be ambiguous to users in general. Success Criterion 2.4.5 Multiple Ways> Understanding Multiple Ways | How to Meet Multiple Ways(Level AA). More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process. Success Criterion 2.4.6 Headings and Labels> Understanding Headings and Labels | How to Meet Headings and Labels(Level AA). Headings and labels describe topic or purpose. Success Criterion 2.4.7 Focus Visible> Understanding Focus Visible | How to Meet Focus Visible(Level AA). Any keyboard operable user interface has a mode of operation where the keyboard focus. indicator is visible. Success Criterion 2.4.8 Location> Understanding Location | How to Meet Location(Level AAA). Information about the user's location within a set of Web pages is available. Success Criterion 2.4.9 Link Purpose (Link Only)> Understanding Link Purpose (Link Only) | How to Meet Link Purpose (Link Only)(Level AAA). A mechanism is available to allow the purpose of each link to be identified from link text alone,. except where the purpose of the link would be ambiguous to users in general. Success Criterion 2.4.10 Section Headings> Understanding Section Headings | How to Meet Section Headings(Level AAA). Section headings are used to organize the content. NoteHeading is used in its general sense and includes titles and other ways to add a. heading to different types of content. NoteThis success criterion covers sections within writing, not user interface components. User Interface components are covered under Success Criterion 4.1.2.Guideline 2.5 Input Modalities> Make it easier for users to operate functionality through various inputs beyond keyboard. Success Criterion 2.5.1 Pointer Gestures> Understanding Pointer Gestures | How to Meet Pointer Gestures(Level A). All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). Success Criterion 2.5.2 Pointer Cancellation> Understanding Pointer Cancellation | How to Meet Pointer Cancellation(Level A). For functionality that can be operated using a single pointer, at least one of the following is true: No Down-Event. The down-event of the pointer is not used to execute any part of the function;. Abort or Undo. Completion of the function is on the up-event, and a mechanism is available to abort the function before completion or to undo the function after completion;. Up Reversal. The up-event reverses any outcome of the preceding down-event;. Essential. Completing the function on the down-event is essential. NoteFunctions that emulate a keyboard or numeric keypad key press are considered essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). Success Criterion 2.5.3 Label in Name> Understanding Label in Name | How to Meet Label in Name(Level A). For user interface components with labels that include text or images of text, the name contains the text that is presented visually. NoteA best practice is to have  the text of the label at the start of the name. Success Criterion 2.5.4 Motion Actuation> Understanding Motion Actuation | How to Meet Motion Actuation(Level A). Functionality that can be operated by device motion or user motion can also be operated by user interface components and responding to the motion can be disabled to prevent accidental actuation, except when: Supported Interface. The motion is used to operate functionality through an accessibility supported interface;. Essential. The motion is essential for the function and doing so would invalidate the activity.  Success Criterion 2.5.5 Target Size> Understanding Target Size | How to Meet Target Size(Level AAA). The size of the target for pointer inputs is at least 44 by 44 CSS pixels except when: Equivalent. The target is available through an equivalent link or control on the same page that is at least 44 by 44 CSS pixels;. Inline. The target is in a sentence or block of text;. User Agent Control. The size of the target is determined by the user agent and is not modified by the author;. Essential. A particular presentation of the target is essential to the information being conveyed.  Success Criterion 2.5.6 Concurrent Input Mechanisms> Understanding Concurrent Input Mechanisms | How to Meet Concurrent Input Mechanisms(Level AAA). Web content does not restrict use of input modalities available on a platform except where the restriction is essential, required to ensure the security of the content, or required to respect user settings. ",
"children": [
  {
"link_name": "2.1 Keyboard Accessible",
"link_href": "#keyboard-accessible",
"section_text": "Guideline 2.1 Keyboard Accessible> Make all functionality available from a keyboard. Success Criterion 2.1.1 Keyboard> Understanding Keyboard | How to Meet Keyboard(Level A). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying. function requires input that depends on the path of the user's movement and not just. the endpoints. NoteThis exception relates to the underlying function, not the input technique. For example,. if using handwriting to enter text, the input technique (handwriting) requires path-dependent. input but the underlying function (text input) does not. NoteThis does not forbid and should not discourage providing mouse input or other input. methods in addition to keyboard operation. Success Criterion 2.1.2 No Keyboard Trap> Understanding No Keyboard Trap | How to Meet No Keyboard Trap(Level A). If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface,. and, if it requires more than unmodified arrow or tab keys or other standard exit. methods, the user is advised of the method for moving focus away. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 2.1.3 Keyboard (No Exception)> Understanding Keyboard (No Exception) | How to Meet Keyboard (No Exception)(Level AAA). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes. Success Criterion 2.1.4 Character Key Shortcuts> Understanding Character Key Shortcuts | How to Meet Character Key Shortcuts(Level A). If a keyboard shortcut is implemented in content using only letter (including upper- and lower-case letters), punctuation, number, or symbol characters, then at least one of the following is true: Turn off. A mechanism is available to turn the shortcut off;. Remap. A mechanism is available to remap the shortcut to use one or more non-printable keyboard characters (e.g. Ctrl, Alt, etc);. Active only on focus. The keyboard shortcut for a user interface component is only active when that component has focus. ",
"children": [
{
  "link_name": "2.1.1 Keyboard",
  "link_href": "#keyboard",
  "section_text": "Success Criterion 2.1.1 Keyboard> Understanding Keyboard | How to Meet Keyboard(Level A). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying. function requires input that depends on the path of the user's movement and not just. the endpoints. NoteThis exception relates to the underlying function, not the input technique. For example,. if using handwriting to enter text, the input technique (handwriting) requires path-dependent. input but the underlying function (text input) does not. NoteThis does not forbid and should not discourage providing mouse input or other input. methods in addition to keyboard operation. ",
  "children": [],
  "secno": "2.1.1 ",
  "depth": 2
},
{
  "link_name": "2.1.2 No Keyboard Trap",
  "link_href": "#no-keyboard-trap",
  "section_text": "Success Criterion 2.1.2 No Keyboard Trap> Understanding No Keyboard Trap | How to Meet No Keyboard Trap(Level A). If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface,. and, if it requires more than unmodified arrow or tab keys or other standard exit. methods, the user is advised of the method for moving focus away. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. ",
  "children": [],
  "secno": "2.1.2 ",
  "depth": 2
},
{
  "link_name": "2.1.3 Keyboard (No Exception)",
  "link_href": "#keyboard-no-exception",
  "section_text": "Success Criterion 2.1.3 Keyboard (No Exception)> Understanding Keyboard (No Exception) | How to Meet Keyboard (No Exception)(Level AAA). All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes. ",
  "children": [],
  "secno": "2.1.3 ",
  "depth": 2
},
{
  "link_name": "2.1.4 Character Key Shortcuts",
  "link_href": "#character-key-shortcuts",
  "section_text": "Success Criterion 2.1.4 Character Key Shortcuts> Understanding Character Key Shortcuts | How to Meet Character Key Shortcuts(Level A). If a keyboard shortcut is implemented in content using only letter (including upper- and lower-case letters), punctuation, number, or symbol characters, then at least one of the following is true: Turn off. A mechanism is available to turn the shortcut off;. Remap. A mechanism is available to remap the shortcut to use one or more non-printable keyboard characters (e.g. Ctrl, Alt, etc);. Active only on focus. The keyboard shortcut for a user interface component is only active when that component has focus. ",
  "children": [],
  "secno": "2.1.4 ",
  "depth": 2
}
],
"secno": "2.1 ",
"depth": 1
  },
  {
"link_name": "2.2 Enough Time",
"link_href": "#enough-time",
"section_text": "Guideline 2.2 Enough Time> Provide users enough time to read and use content. Success Criterion 2.2.1 Timing Adjustable> Understanding Timing Adjustable | How to Meet Timing Adjustable(Level A). For each time limit that is set by the content, at least one of the following is true: Turn off The user is allowed to turn off the time limit before encountering it; or Adjust The user is allowed to adjust the time limit before encountering it over a wide range. that is at least ten times the length of the default setting; or. Extend The user is warned before time expires and given at least 20 seconds to extend the. time limit with a simple action (for example, press the space bar), and the user. is allowed to extend the time limit at least ten times; or. Real-time Exception The time limit is a required part of a real-time event (for example, an auction),. and no alternative to the time limit is possible; or. Essential Exception The time limit is essential and extending it would invalidate the activity; or. 20 Hour Exception The time limit is longer than 20 hours. NoteThis success criterion helps ensure that users can complete tasks without unexpected. changes in content or context that are a result of a time limit. This success criterion. should be considered in conjunction with Success Criterion 3.2.1, which puts limits on changes of content or context as a result of user action. Success Criterion 2.2.2 Pause, Stop, Hide> Understanding Pause, Stop, Hide | How to Meet Pause, Stop, Hide(Level A). For moving, blinking, scrolling, or auto-updating information, all of the following are true:. Moving, blinking, scrolling For any moving, blinking or scrolling information that (1) starts automatically, (2). lasts more than five seconds, and (3) is presented in parallel with other content,. there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity. where it is essential; and. Auto-updating For any auto-updating information that (1) starts automatically and (2) is presented. in parallel with other content, there is a mechanism for the user to pause, stop,. or hide it or to control the frequency of the update unless the auto-updating is part. of an activity where it is essential. NoteFor requirements related to flickering or flashing content, refer to Guideline 2.3. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. NoteContent that is updated periodically by software or that is streamed to the user agent. is not required to preserve or present information that is generated or received between. the initiation of the pause and resuming presentation, as this may not be technically. possible, and in many situations could be misleading to do so. NoteAn animation that occurs as part of a preload phase or similar situation can be considered. essential if interaction cannot occur during that phase for all users and if not indicating. progress could confuse users or cause them to think that content was frozen or broken. Success Criterion 2.2.3 No Timing> Understanding No Timing | How to Meet No Timing(Level AAA). Timing is not an essential part of the event or activity presented by the content, except for non-interactive. synchronized media and real-time events. Success Criterion 2.2.4 Interruptions> Understanding Interruptions | How to Meet Interruptions(Level AAA). Interruptions can be postponed or suppressed by the user, except interruptions involving. an emergency. Success Criterion 2.2.5 Re-authenticating> Understanding Re-authenticating | How to Meet Re-authenticating(Level AAA). When an authenticated session expires, the user can continue the activity without. loss of data after re-authenticating. Success Criterion 2.2.6 Timeouts> Understanding Timeouts | How to Meet Timeouts(Level AAA). Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions. NotePrivacy regulations may require explicit user consent before user identification has been authenticated and before user data is preserved. In cases where the user is a minor, explicit consent may not be solicited in most jurisdictions, countries or regions. Consultation with privacy professionals and legal counsel is advised when considering data preservation as an approach to satisfy this success criterion. ",
"children": [
{
  "link_name": "2.2.1 Timing Adjustable",
  "link_href": "#timing-adjustable",
  "section_text": "Success Criterion 2.2.1 Timing Adjustable> Understanding Timing Adjustable | How to Meet Timing Adjustable(Level A). For each time limit that is set by the content, at least one of the following is true: Turn off The user is allowed to turn off the time limit before encountering it; or Adjust The user is allowed to adjust the time limit before encountering it over a wide range. that is at least ten times the length of the default setting; or. Extend The user is warned before time expires and given at least 20 seconds to extend the. time limit with a simple action (for example, press the space bar), and the user. is allowed to extend the time limit at least ten times; or. Real-time Exception The time limit is a required part of a real-time event (for example, an auction),. and no alternative to the time limit is possible; or. Essential Exception The time limit is essential and extending it would invalidate the activity; or. 20 Hour Exception The time limit is longer than 20 hours. NoteThis success criterion helps ensure that users can complete tasks without unexpected. changes in content or context that are a result of a time limit. This success criterion. should be considered in conjunction with Success Criterion 3.2.1, which puts limits on changes of content or context as a result of user action. ",
  "children": [],
  "secno": "2.2.1 ",
  "depth": 2
},
{
  "link_name": "2.2.2 Pause, Stop, Hide",
  "link_href": "#pause-stop-hide",
  "section_text": "Success Criterion 2.2.2 Pause, Stop, Hide> Understanding Pause, Stop, Hide | How to Meet Pause, Stop, Hide(Level A). For moving, blinking, scrolling, or auto-updating information, all of the following are true:. Moving, blinking, scrolling For any moving, blinking or scrolling information that (1) starts automatically, (2). lasts more than five seconds, and (3) is presented in parallel with other content,. there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity. where it is essential; and. Auto-updating For any auto-updating information that (1) starts automatically and (2) is presented. in parallel with other content, there is a mechanism for the user to pause, stop,. or hide it or to control the frequency of the update unless the auto-updating is part. of an activity where it is essential. NoteFor requirements related to flickering or flashing content, refer to Guideline 2.3. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. NoteContent that is updated periodically by software or that is streamed to the user agent. is not required to preserve or present information that is generated or received between. the initiation of the pause and resuming presentation, as this may not be technically. possible, and in many situations could be misleading to do so. NoteAn animation that occurs as part of a preload phase or similar situation can be considered. essential if interaction cannot occur during that phase for all users and if not indicating. progress could confuse users or cause them to think that content was frozen or broken. ",
  "children": [],
  "secno": "2.2.2 ",
  "depth": 2
},
{
  "link_name": "2.2.3 No Timing",
  "link_href": "#no-timing",
  "section_text": "Success Criterion 2.2.3 No Timing> Understanding No Timing | How to Meet No Timing(Level AAA). Timing is not an essential part of the event or activity presented by the content, except for non-interactive. synchronized media and real-time events. ",
  "children": [],
  "secno": "2.2.3 ",
  "depth": 2
},
{
  "link_name": "2.2.4 Interruptions",
  "link_href": "#interruptions",
  "section_text": "Success Criterion 2.2.4 Interruptions> Understanding Interruptions | How to Meet Interruptions(Level AAA). Interruptions can be postponed or suppressed by the user, except interruptions involving. an emergency. ",
  "children": [],
  "secno": "2.2.4 ",
  "depth": 2
},
{
  "link_name": "2.2.5 Re-authenticating",
  "link_href": "#re-authenticating",
  "section_text": "Success Criterion 2.2.5 Re-authenticating> Understanding Re-authenticating | How to Meet Re-authenticating(Level AAA). When an authenticated session expires, the user can continue the activity without. loss of data after re-authenticating. ",
  "children": [],
  "secno": "2.2.5 ",
  "depth": 2
},
{
  "link_name": "2.2.6 Timeouts",
  "link_href": "#timeouts",
  "section_text": "Success Criterion 2.2.6 Timeouts> Understanding Timeouts | How to Meet Timeouts(Level AAA). Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions. NotePrivacy regulations may require explicit user consent before user identification has been authenticated and before user data is preserved. In cases where the user is a minor, explicit consent may not be solicited in most jurisdictions, countries or regions. Consultation with privacy professionals and legal counsel is advised when considering data preservation as an approach to satisfy this success criterion. ",
  "children": [],
  "secno": "2.2.6 ",
  "depth": 2
}
],
"secno": "2.2 ",
"depth": 1
  },
  {
"link_name": "2.3 Seizures and Physical Reactions",
"link_href": "#seizures-and-physical-reactions",
"section_text": "Guideline 2.3 Seizures and Physical Reactions> Do not design content in a way that is known to cause seizures or physical reactions. Success Criterion 2.3.1 Three Flashes or Below Threshold> Understanding Three Flashes or Below Threshold | How to Meet Three Flashes or Below Threshold(Level A). Web pages do not contain anything that flashes more than three times in any one second period,. or the flash is below the general flash and red flash thresholds. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. Success Criterion 2.3.2 Three Flashes> Understanding Three Flashes | How to Meet Three Flashes(Level AAA). Web pages do not contain anything that flashes more than three times in any one second period. Success Criterion 2.3.3 Animation from Interactions> Understanding Animation from Interactions | How to Meet Animation from Interactions(Level AAA). Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed. ",
"children": [
{
  "link_name": "2.3.1 Three Flashes or Below Threshold",
  "link_href": "#three-flashes-or-below-threshold",
  "section_text": "Success Criterion 2.3.1 Three Flashes or Below Threshold> Understanding Three Flashes or Below Threshold | How to Meet Three Flashes or Below Threshold(Level A). Web pages do not contain anything that flashes more than three times in any one second period,. or the flash is below the general flash and red flash thresholds. NoteSince any content that does not meet this success criterion can interfere with a user's. ability to use the whole page, all content on the Web page (whether it is used to. meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference. ",
  "children": [],
  "secno": "2.3.1 ",
  "depth": 2
},
{
  "link_name": "2.3.2 Three Flashes",
  "link_href": "#three-flashes",
  "section_text": "Success Criterion 2.3.2 Three Flashes> Understanding Three Flashes | How to Meet Three Flashes(Level AAA). Web pages do not contain anything that flashes more than three times in any one second period. ",
  "children": [],
  "secno": "2.3.2 ",
  "depth": 2
},
{
  "link_name": "2.3.3 Animation from Interactions",
  "link_href": "#animation-from-interactions",
  "section_text": "Success Criterion 2.3.3 Animation from Interactions> Understanding Animation from Interactions | How to Meet Animation from Interactions(Level AAA). Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed. ",
  "children": [],
  "secno": "2.3.3 ",
  "depth": 2
}
],
"secno": "2.3 ",
"depth": 1
  },
  {
"link_name": "2.4 Navigable",
"link_href": "#navigable",
"section_text": "Guideline 2.4 Navigable> Provide ways to help users navigate, find content, and determine where they are. Success Criterion 2.4.1 Bypass Blocks> Understanding Bypass Blocks | How to Meet Bypass Blocks(Level A). A mechanism is available to bypass blocks of content that are repeated on multiple Web pages. Success Criterion 2.4.2 Page Titled> Understanding Page Titled | How to Meet Page Titled(Level A). Web pages have titles that describe topic or purpose. Success Criterion 2.4.3 Focus Order> Understanding Focus Order | How to Meet Focus Order(Level A). If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive. focus in an order that preserves meaning and operability. Success Criterion 2.4.4 Link Purpose (In Context)> Understanding Link Purpose (In Context) | How to Meet Link Purpose (In Context)(Level A). The purpose of each link can be determined from the link text alone or from the link text together with its. programmatically determined link context, except where the purpose of the link would be ambiguous to users in general. Success Criterion 2.4.5 Multiple Ways> Understanding Multiple Ways | How to Meet Multiple Ways(Level AA). More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process. Success Criterion 2.4.6 Headings and Labels> Understanding Headings and Labels | How to Meet Headings and Labels(Level AA). Headings and labels describe topic or purpose. Success Criterion 2.4.7 Focus Visible> Understanding Focus Visible | How to Meet Focus Visible(Level AA). Any keyboard operable user interface has a mode of operation where the keyboard focus. indicator is visible. Success Criterion 2.4.8 Location> Understanding Location | How to Meet Location(Level AAA). Information about the user's location within a set of Web pages is available. Success Criterion 2.4.9 Link Purpose (Link Only)> Understanding Link Purpose (Link Only) | How to Meet Link Purpose (Link Only)(Level AAA). A mechanism is available to allow the purpose of each link to be identified from link text alone,. except where the purpose of the link would be ambiguous to users in general. Success Criterion 2.4.10 Section Headings> Understanding Section Headings | How to Meet Section Headings(Level AAA). Section headings are used to organize the content. NoteHeading is used in its general sense and includes titles and other ways to add a. heading to different types of content. NoteThis success criterion covers sections within writing, not user interface components. User Interface components are covered under Success Criterion 4.1.2. ",
"children": [
{
  "link_name": "2.4.1 Bypass Blocks",
  "link_href": "#bypass-blocks",
  "section_text": "Success Criterion 2.4.1 Bypass Blocks> Understanding Bypass Blocks | How to Meet Bypass Blocks(Level A). A mechanism is available to bypass blocks of content that are repeated on multiple Web pages. ",
  "children": [],
  "secno": "2.4.1 ",
  "depth": 2
},
{
  "link_name": "2.4.2 Page Titled",
  "link_href": "#page-titled",
  "section_text": "Success Criterion 2.4.2 Page Titled> Understanding Page Titled | How to Meet Page Titled(Level A). Web pages have titles that describe topic or purpose. ",
  "children": [],
  "secno": "2.4.2 ",
  "depth": 2
},
{
  "link_name": "2.4.3 Focus Order",
  "link_href": "#focus-order",
  "section_text": "Success Criterion 2.4.3 Focus Order> Understanding Focus Order | How to Meet Focus Order(Level A). If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive. focus in an order that preserves meaning and operability. ",
  "children": [],
  "secno": "2.4.3 ",
  "depth": 2
},
{
  "link_name": "2.4.4 Link Purpose (In Context)",
  "link_href": "#link-purpose-in-context",
  "section_text": "Success Criterion 2.4.4 Link Purpose (In Context)> Understanding Link Purpose (In Context) | How to Meet Link Purpose (In Context)(Level A). The purpose of each link can be determined from the link text alone or from the link text together with its. programmatically determined link context, except where the purpose of the link would be ambiguous to users in general. ",
  "children": [],
  "secno": "2.4.4 ",
  "depth": 2
},
{
  "link_name": "2.4.5 Multiple Ways",
  "link_href": "#multiple-ways",
  "section_text": "Success Criterion 2.4.5 Multiple Ways> Understanding Multiple Ways | How to Meet Multiple Ways(Level AA). More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process. ",
  "children": [],
  "secno": "2.4.5 ",
  "depth": 2
},
{
  "link_name": "2.4.6 Headings and Labels",
  "link_href": "#headings-and-labels",
  "section_text": "Success Criterion 2.4.6 Headings and Labels> Understanding Headings and Labels | How to Meet Headings and Labels(Level AA). Headings and labels describe topic or purpose. ",
  "children": [],
  "secno": "2.4.6 ",
  "depth": 2
},
{
  "link_name": "2.4.7 Focus Visible",
  "link_href": "#focus-visible",
  "section_text": "Success Criterion 2.4.7 Focus Visible> Understanding Focus Visible | How to Meet Focus Visible(Level AA). Any keyboard operable user interface has a mode of operation where the keyboard focus. indicator is visible. ",
  "children": [],
  "secno": "2.4.7 ",
  "depth": 2
},
{
  "link_name": "2.4.8 Location",
  "link_href": "#location",
  "section_text": "Success Criterion 2.4.8 Location> Understanding Location | How to Meet Location(Level AAA). Information about the user's location within a set of Web pages is available. ",
  "children": [],
  "secno": "2.4.8 ",
  "depth": 2
},
{
  "link_name": "2.4.9 Link Purpose (Link Only)",
  "link_href": "#link-purpose-link-only",
  "section_text": "Success Criterion 2.4.9 Link Purpose (Link Only)> Understanding Link Purpose (Link Only) | How to Meet Link Purpose (Link Only)(Level AAA). A mechanism is available to allow the purpose of each link to be identified from link text alone,. except where the purpose of the link would be ambiguous to users in general. ",
  "children": [],
  "secno": "2.4.9 ",
  "depth": 2
},
{
  "link_name": "2.4.10 Section Headings",
  "link_href": "#section-headings",
  "section_text": "Success Criterion 2.4.10 Section Headings> Understanding Section Headings | How to Meet Section Headings(Level AAA). Section headings are used to organize the content. NoteHeading is used in its general sense and includes titles and other ways to add a. heading to different types of content. NoteThis success criterion covers sections within writing, not user interface components. User Interface components are covered under Success Criterion 4.1.2. ",
  "children": [],
  "secno": "2.4.10 ",
  "depth": 2
}
],
"secno": "2.4 ",
"depth": 1
  },
  {
"link_name": "2.5 Input Modalities",
"link_href": "#input-modalities",
"section_text": "Guideline 2.5 Input Modalities> Make it easier for users to operate functionality through various inputs beyond keyboard. Success Criterion 2.5.1 Pointer Gestures> Understanding Pointer Gestures | How to Meet Pointer Gestures(Level A). All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). Success Criterion 2.5.2 Pointer Cancellation> Understanding Pointer Cancellation | How to Meet Pointer Cancellation(Level A). For functionality that can be operated using a single pointer, at least one of the following is true: No Down-Event. The down-event of the pointer is not used to execute any part of the function;. Abort or Undo. Completion of the function is on the up-event, and a mechanism is available to abort the function before completion or to undo the function after completion;. Up Reversal. The up-event reverses any outcome of the preceding down-event;. Essential. Completing the function on the down-event is essential. NoteFunctions that emulate a keyboard or numeric keypad key press are considered essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). Success Criterion 2.5.3 Label in Name> Understanding Label in Name | How to Meet Label in Name(Level A). For user interface components with labels that include text or images of text, the name contains the text that is presented visually. NoteA best practice is to have  the text of the label at the start of the name. Success Criterion 2.5.4 Motion Actuation> Understanding Motion Actuation | How to Meet Motion Actuation(Level A). Functionality that can be operated by device motion or user motion can also be operated by user interface components and responding to the motion can be disabled to prevent accidental actuation, except when: Supported Interface. The motion is used to operate functionality through an accessibility supported interface;. Essential. The motion is essential for the function and doing so would invalidate the activity.  Success Criterion 2.5.5 Target Size> Understanding Target Size | How to Meet Target Size(Level AAA). The size of the target for pointer inputs is at least 44 by 44 CSS pixels except when: Equivalent. The target is available through an equivalent link or control on the same page that is at least 44 by 44 CSS pixels;. Inline. The target is in a sentence or block of text;. User Agent Control. The size of the target is determined by the user agent and is not modified by the author;. Essential. A particular presentation of the target is essential to the information being conveyed.  Success Criterion 2.5.6 Concurrent Input Mechanisms> Understanding Concurrent Input Mechanisms | How to Meet Concurrent Input Mechanisms(Level AAA). Web content does not restrict use of input modalities available on a platform except where the restriction is essential, required to ensure the security of the content, or required to respect user settings. ",
"children": [
{
  "link_name": "2.5.1 Pointer Gestures",
  "link_href": "#pointer-gestures",
  "section_text": "Success Criterion 2.5.1 Pointer Gestures> Understanding Pointer Gestures | How to Meet Pointer Gestures(Level A). All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). ",
  "children": [],
  "secno": "2.5.1 ",
  "depth": 2
},
{
  "link_name": "2.5.2 Pointer Cancellation",
  "link_href": "#pointer-cancellation",
  "section_text": "Success Criterion 2.5.2 Pointer Cancellation> Understanding Pointer Cancellation | How to Meet Pointer Cancellation(Level A). For functionality that can be operated using a single pointer, at least one of the following is true: No Down-Event. The down-event of the pointer is not used to execute any part of the function;. Abort or Undo. Completion of the function is on the up-event, and a mechanism is available to abort the function before completion or to undo the function after completion;. Up Reversal. The up-event reverses any outcome of the preceding down-event;. Essential. Completing the function on the down-event is essential. NoteFunctions that emulate a keyboard or numeric keypad key press are considered essential. NoteThis requirement applies to web content that interprets pointer actions (i.e. this does not apply to actions that are required to operate the user agent or assistive technology). ",
  "children": [],
  "secno": "2.5.2 ",
  "depth": 2
},
{
  "link_name": "2.5.3 Label in Name",
  "link_href": "#label-in-name",
  "section_text": "Success Criterion 2.5.3 Label in Name> Understanding Label in Name | How to Meet Label in Name(Level A). For user interface components with labels that include text or images of text, the name contains the text that is presented visually. NoteA best practice is to have  the text of the label at the start of the name. ",
  "children": [],
  "secno": "2.5.3 ",
  "depth": 2
},
{
  "link_name": "2.5.4 Motion Actuation",
  "link_href": "#motion-actuation",
  "section_text": "Success Criterion 2.5.4 Motion Actuation> Understanding Motion Actuation | How to Meet Motion Actuation(Level A). Functionality that can be operated by device motion or user motion can also be operated by user interface components and responding to the motion can be disabled to prevent accidental actuation, except when: Supported Interface. The motion is used to operate functionality through an accessibility supported interface;. Essential. The motion is essential for the function and doing so would invalidate the activity. ",
  "children": [],
  "secno": "2.5.4 ",
  "depth": 2
},
{
  "link_name": "2.5.5 Target Size",
  "link_href": "#target-size",
  "section_text": "Success Criterion 2.5.5 Target Size> Understanding Target Size | How to Meet Target Size(Level AAA). The size of the target for pointer inputs is at least 44 by 44 CSS pixels except when: Equivalent. The target is available through an equivalent link or control on the same page that is at least 44 by 44 CSS pixels;. Inline. The target is in a sentence or block of text;. User Agent Control. The size of the target is determined by the user agent and is not modified by the author;. Essential. A particular presentation of the target is essential to the information being conveyed. ",
  "children": [],
  "secno": "2.5.5 ",
  "depth": 2
},
{
  "link_name": "2.5.6 Concurrent Input Mechanisms",
  "link_href": "#concurrent-input-mechanisms",
  "section_text": "Success Criterion 2.5.6 Concurrent Input Mechanisms> Understanding Concurrent Input Mechanisms | How to Meet Concurrent Input Mechanisms(Level AAA). Web content does not restrict use of input modalities available on a platform except where the restriction is essential, required to ensure the security of the content, or required to respect user settings. ",
  "children": [],
  "secno": "2.5.6 ",
  "depth": 2
}
],
"secno": "2.5 ",
"depth": 1
  }
],
"secno": "2. ",
"depth": 0
},
{
"link_name": "3.  Understandable ",
"link_href": "#understandable",
"section_text": "3.  Understandable > Information and the operation of user interface must be understandable. Guideline 3.1 Readable> Make text content readable and understandable. Success Criterion 3.1.1 Language of Page> Understanding Language of Page | How to Meet Language of Page(Level A). The default human language of each Web page can be programmatically determined. Success Criterion 3.1.2 Language of Parts> Understanding Language of Parts | How to Meet Language of Parts(Level AA). The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words. or phrases that have become part of the vernacular of the immediately surrounding. text. Success Criterion 3.1.3 Unusual Words> Understanding Unusual Words | How to Meet Unusual Words(Level AAA). A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon. Success Criterion 3.1.4 Abbreviations> Understanding Abbreviations | How to Meet Abbreviations(Level AAA). A mechanism for identifying the expanded form or meaning of abbreviations is available. Success Criterion 3.1.5 Reading Level> Understanding Reading Level | How to Meet Reading Level(Level AAA). When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower. secondary education level, is available. Success Criterion 3.1.6 Pronunciation> Understanding Pronunciation | How to Meet Pronunciation(Level AAA). A mechanism is available for identifying specific pronunciation of words where meaning of the. words, in context, is ambiguous without knowing the pronunciation.Guideline 3.2 Predictable> Make Web pages appear and operate in predictable ways. Success Criterion 3.2.1 On Focus> Understanding On Focus | How to Meet On Focus(Level A). When any user interface component receives focus, it does not initiate a change of context. Success Criterion 3.2.2 On Input> Understanding On Input | How to Meet On Input(Level A). Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component. Success Criterion 3.2.3 Consistent Navigation> Understanding Consistent Navigation | How to Meet Consistent Navigation(Level AA). Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user. Success Criterion 3.2.4 Consistent Identification> Understanding Consistent Identification | How to Meet Consistent Identification(Level AA). Components that have the same functionality within a set of Web pages are identified consistently. Success Criterion 3.2.5 Change on Request> Understanding Change on Request | How to Meet Change on Request(Level AAA). Changes of context are initiated only by user request or a mechanism is available to turn off such changes.Guideline 3.3 Input Assistance> Help users avoid and correct mistakes. Success Criterion 3.3.1 Error Identification> Understanding Error Identification | How to Meet Error Identification(Level A). If an input error is automatically detected, the item that is in error is identified and the error. is described to the user in text. Success Criterion 3.3.2 Labels or Instructions> Understanding Labels or Instructions | How to Meet Labels or Instructions(Level A). Labels or instructions are provided when content requires user input. Success Criterion 3.3.3 Error Suggestion> Understanding Error Suggestion | How to Meet Error Suggestion(Level AA). If an input error is automatically detected and suggestions for correction are known, then the suggestions. are provided to the user, unless it would jeopardize the security or purpose of the. content. Success Criterion 3.3.4 Error Prevention (Legal, Financial, Data)> Understanding Error Prevention (Legal, Financial, Data) | How to Meet Error Prevention (Legal, Financial, Data)(Level AA). For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of. the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.  Success Criterion 3.3.5 Help> Understanding Help | How to Meet Help(Level AAA). Context-sensitive help is available. Success Criterion 3.3.6 Error Prevention (All)> Understanding Error Prevention (All) | How to Meet Error Prevention (All)(Level AAA). For Web pages that require the user to submit information, at least one of the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.  ",
"children": [
  {
"link_name": "3.1 Readable",
"link_href": "#readable",
"section_text": "Guideline 3.1 Readable> Make text content readable and understandable. Success Criterion 3.1.1 Language of Page> Understanding Language of Page | How to Meet Language of Page(Level A). The default human language of each Web page can be programmatically determined. Success Criterion 3.1.2 Language of Parts> Understanding Language of Parts | How to Meet Language of Parts(Level AA). The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words. or phrases that have become part of the vernacular of the immediately surrounding. text. Success Criterion 3.1.3 Unusual Words> Understanding Unusual Words | How to Meet Unusual Words(Level AAA). A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon. Success Criterion 3.1.4 Abbreviations> Understanding Abbreviations | How to Meet Abbreviations(Level AAA). A mechanism for identifying the expanded form or meaning of abbreviations is available. Success Criterion 3.1.5 Reading Level> Understanding Reading Level | How to Meet Reading Level(Level AAA). When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower. secondary education level, is available. Success Criterion 3.1.6 Pronunciation> Understanding Pronunciation | How to Meet Pronunciation(Level AAA). A mechanism is available for identifying specific pronunciation of words where meaning of the. words, in context, is ambiguous without knowing the pronunciation. ",
"children": [
{
  "link_name": "3.1.1 Language of Page",
  "link_href": "#language-of-page",
  "section_text": "Success Criterion 3.1.1 Language of Page> Understanding Language of Page | How to Meet Language of Page(Level A). The default human language of each Web page can be programmatically determined. ",
  "children": [],
  "secno": "3.1.1 ",
  "depth": 2
},
{
  "link_name": "3.1.2 Language of Parts",
  "link_href": "#language-of-parts",
  "section_text": "Success Criterion 3.1.2 Language of Parts> Understanding Language of Parts | How to Meet Language of Parts(Level AA). The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words. or phrases that have become part of the vernacular of the immediately surrounding. text. ",
  "children": [],
  "secno": "3.1.2 ",
  "depth": 2
},
{
  "link_name": "3.1.3 Unusual Words",
  "link_href": "#unusual-words",
  "section_text": "Success Criterion 3.1.3 Unusual Words> Understanding Unusual Words | How to Meet Unusual Words(Level AAA). A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon. ",
  "children": [],
  "secno": "3.1.3 ",
  "depth": 2
},
{
  "link_name": "3.1.4 Abbreviations",
  "link_href": "#abbreviations",
  "section_text": "Success Criterion 3.1.4 Abbreviations> Understanding Abbreviations | How to Meet Abbreviations(Level AAA). A mechanism for identifying the expanded form or meaning of abbreviations is available. ",
  "children": [],
  "secno": "3.1.4 ",
  "depth": 2
},
{
  "link_name": "3.1.5 Reading Level",
  "link_href": "#reading-level",
  "section_text": "Success Criterion 3.1.5 Reading Level> Understanding Reading Level | How to Meet Reading Level(Level AAA). When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower. secondary education level, is available. ",
  "children": [],
  "secno": "3.1.5 ",
  "depth": 2
},
{
  "link_name": "3.1.6 Pronunciation",
  "link_href": "#pronunciation",
  "section_text": "Success Criterion 3.1.6 Pronunciation> Understanding Pronunciation | How to Meet Pronunciation(Level AAA). A mechanism is available for identifying specific pronunciation of words where meaning of the. words, in context, is ambiguous without knowing the pronunciation. ",
  "children": [],
  "secno": "3.1.6 ",
  "depth": 2
}
],
"secno": "3.1 ",
"depth": 1
  },
  {
"link_name": "3.2 Predictable",
"link_href": "#predictable",
"section_text": "Guideline 3.2 Predictable> Make Web pages appear and operate in predictable ways. Success Criterion 3.2.1 On Focus> Understanding On Focus | How to Meet On Focus(Level A). When any user interface component receives focus, it does not initiate a change of context. Success Criterion 3.2.2 On Input> Understanding On Input | How to Meet On Input(Level A). Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component. Success Criterion 3.2.3 Consistent Navigation> Understanding Consistent Navigation | How to Meet Consistent Navigation(Level AA). Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user. Success Criterion 3.2.4 Consistent Identification> Understanding Consistent Identification | How to Meet Consistent Identification(Level AA). Components that have the same functionality within a set of Web pages are identified consistently. Success Criterion 3.2.5 Change on Request> Understanding Change on Request | How to Meet Change on Request(Level AAA). Changes of context are initiated only by user request or a mechanism is available to turn off such changes. ",
"children": [
{
  "link_name": "3.2.1 On Focus",
  "link_href": "#on-focus",
  "section_text": "Success Criterion 3.2.1 On Focus> Understanding On Focus | How to Meet On Focus(Level A). When any user interface component receives focus, it does not initiate a change of context. ",
  "children": [],
  "secno": "3.2.1 ",
  "depth": 2
},
{
  "link_name": "3.2.2 On Input",
  "link_href": "#on-input",
  "section_text": "Success Criterion 3.2.2 On Input> Understanding On Input | How to Meet On Input(Level A). Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component. ",
  "children": [],
  "secno": "3.2.2 ",
  "depth": 2
},
{
  "link_name": "3.2.3 Consistent Navigation",
  "link_href": "#consistent-navigation",
  "section_text": "Success Criterion 3.2.3 Consistent Navigation> Understanding Consistent Navigation | How to Meet Consistent Navigation(Level AA). Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user. ",
  "children": [],
  "secno": "3.2.3 ",
  "depth": 2
},
{
  "link_name": "3.2.4 Consistent Identification",
  "link_href": "#consistent-identification",
  "section_text": "Success Criterion 3.2.4 Consistent Identification> Understanding Consistent Identification | How to Meet Consistent Identification(Level AA). Components that have the same functionality within a set of Web pages are identified consistently. ",
  "children": [],
  "secno": "3.2.4 ",
  "depth": 2
},
{
  "link_name": "3.2.5 Change on Request",
  "link_href": "#change-on-request",
  "section_text": "Success Criterion 3.2.5 Change on Request> Understanding Change on Request | How to Meet Change on Request(Level AAA). Changes of context are initiated only by user request or a mechanism is available to turn off such changes. ",
  "children": [],
  "secno": "3.2.5 ",
  "depth": 2
}
],
"secno": "3.2 ",
"depth": 1
  },
  {
"link_name": "3.3 Input Assistance",
"link_href": "#input-assistance",
"section_text": "Guideline 3.3 Input Assistance> Help users avoid and correct mistakes. Success Criterion 3.3.1 Error Identification> Understanding Error Identification | How to Meet Error Identification(Level A). If an input error is automatically detected, the item that is in error is identified and the error. is described to the user in text. Success Criterion 3.3.2 Labels or Instructions> Understanding Labels or Instructions | How to Meet Labels or Instructions(Level A). Labels or instructions are provided when content requires user input. Success Criterion 3.3.3 Error Suggestion> Understanding Error Suggestion | How to Meet Error Suggestion(Level AA). If an input error is automatically detected and suggestions for correction are known, then the suggestions. are provided to the user, unless it would jeopardize the security or purpose of the. content. Success Criterion 3.3.4 Error Prevention (Legal, Financial, Data)> Understanding Error Prevention (Legal, Financial, Data) | How to Meet Error Prevention (Legal, Financial, Data)(Level AA). For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of. the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.  Success Criterion 3.3.5 Help> Understanding Help | How to Meet Help(Level AAA). Context-sensitive help is available. Success Criterion 3.3.6 Error Prevention (All)> Understanding Error Prevention (All) | How to Meet Error Prevention (All)(Level AAA). For Web pages that require the user to submit information, at least one of the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission. ",
"children": [
{
  "link_name": "3.3.1 Error Identification",
  "link_href": "#error-identification",
  "section_text": "Success Criterion 3.3.1 Error Identification> Understanding Error Identification | How to Meet Error Identification(Level A). If an input error is automatically detected, the item that is in error is identified and the error. is described to the user in text. ",
  "children": [],
  "secno": "3.3.1 ",
  "depth": 2
},
{
  "link_name": "3.3.2 Labels or Instructions",
  "link_href": "#labels-or-instructions",
  "section_text": "Success Criterion 3.3.2 Labels or Instructions> Understanding Labels or Instructions | How to Meet Labels or Instructions(Level A). Labels or instructions are provided when content requires user input. ",
  "children": [],
  "secno": "3.3.2 ",
  "depth": 2
},
{
  "link_name": "3.3.3 Error Suggestion",
  "link_href": "#error-suggestion",
  "section_text": "Success Criterion 3.3.3 Error Suggestion> Understanding Error Suggestion | How to Meet Error Suggestion(Level AA). If an input error is automatically detected and suggestions for correction are known, then the suggestions. are provided to the user, unless it would jeopardize the security or purpose of the. content. ",
  "children": [],
  "secno": "3.3.3 ",
  "depth": 2
},
{
  "link_name": "3.3.4 Error Prevention (Legal, Financial, Data)",
  "link_href": "#error-prevention-legal-financial-data",
  "section_text": "Success Criterion 3.3.4 Error Prevention (Legal, Financial, Data)> Understanding Error Prevention (Legal, Financial, Data) | How to Meet Error Prevention (Legal, Financial, Data)(Level AA). For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of. the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission. ",
  "children": [],
  "secno": "3.3.4 ",
  "depth": 2
},
{
  "link_name": "3.3.5 Help",
  "link_href": "#help",
  "section_text": "Success Criterion 3.3.5 Help> Understanding Help | How to Meet Help(Level AAA). Context-sensitive help is available. ",
  "children": [],
  "secno": "3.3.5 ",
  "depth": 2
},
{
  "link_name": "3.3.6 Error Prevention (All)",
  "link_href": "#error-prevention-all",
  "section_text": "Success Criterion 3.3.6 Error Prevention (All)> Understanding Error Prevention (All) | How to Meet Error Prevention (All)(Level AAA). For Web pages that require the user to submit information, at least one of the following is true:. ReversibleSubmissions are reversible. CheckedData entered by the user is checked for input errors and the user is provided an opportunity to correct them. ConfirmedA mechanism is available for reviewing, confirming, and correcting information before finalizing the submission. ",
  "children": [],
  "secno": "3.3.6 ",
  "depth": 2
}
],
"secno": "3.3 ",
"depth": 1
  }
],
"secno": "3. ",
"depth": 0
},
{
"link_name": "4.  Robust ",
"link_href": "#robust",
"section_text": "4.  Robust > Content must be robust enough that it can be interpreted by by a wide variety of user agents, including assistive technologies. Guideline 4.1 Compatible> Maximize compatibility with current and future user agents, including assistive technologies. Success Criterion 4.1.1 Parsing> Understanding Parsing | How to Meet Parsing(Level A). In content implemented using markup languages, elements have complete start and end. tags, elements are nested according to their specifications, elements do not contain. duplicate attributes, and any IDs are unique, except where the specifications allow. these features. NoteStart and end tags that are missing a critical character in their formation, such. as a closing angle bracket or a mismatched attribute value quotation mark are not. complete. Success Criterion 4.1.2 Name, Role, Value> Understanding Name, Role, Value | How to Meet Name, Role, Value(Level A). For all user interface components (including but not limited to: form elements, links and components generated by scripts),. the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies. NoteThis success criterion is primarily for Web authors who develop or script their own. user interface components. For example, standard HTML controls already meet this success. criterion when used according to specification. Success Criterion 4.1.3 Status Messages> Understanding Status Messages | How to Meet Status Messages(Level AA). In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus. ",
"children": [
  {
"link_name": "4.1 Compatible",
"link_href": "#compatible",
"section_text": "Guideline 4.1 Compatible> Maximize compatibility with current and future user agents, including assistive technologies. Success Criterion 4.1.1 Parsing> Understanding Parsing | How to Meet Parsing(Level A). In content implemented using markup languages, elements have complete start and end. tags, elements are nested according to their specifications, elements do not contain. duplicate attributes, and any IDs are unique, except where the specifications allow. these features. NoteStart and end tags that are missing a critical character in their formation, such. as a closing angle bracket or a mismatched attribute value quotation mark are not. complete. Success Criterion 4.1.2 Name, Role, Value> Understanding Name, Role, Value | How to Meet Name, Role, Value(Level A). For all user interface components (including but not limited to: form elements, links and components generated by scripts),. the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies. NoteThis success criterion is primarily for Web authors who develop or script their own. user interface components. For example, standard HTML controls already meet this success. criterion when used according to specification. Success Criterion 4.1.3 Status Messages> Understanding Status Messages | How to Meet Status Messages(Level AA). In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus. ",
"children": [
{
  "link_name": "4.1.1 Parsing",
  "link_href": "#parsing",
  "section_text": "Success Criterion 4.1.1 Parsing> Understanding Parsing | How to Meet Parsing(Level A). In content implemented using markup languages, elements have complete start and end. tags, elements are nested according to their specifications, elements do not contain. duplicate attributes, and any IDs are unique, except where the specifications allow. these features. NoteStart and end tags that are missing a critical character in their formation, such. as a closing angle bracket or a mismatched attribute value quotation mark are not. complete. ",
  "children": [],
  "secno": "4.1.1 ",
  "depth": 2
},
{
  "link_name": "4.1.2 Name, Role, Value",
  "link_href": "#name-role-value",
  "section_text": "Success Criterion 4.1.2 Name, Role, Value> Understanding Name, Role, Value | How to Meet Name, Role, Value(Level A). For all user interface components (including but not limited to: form elements, links and components generated by scripts),. the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies. NoteThis success criterion is primarily for Web authors who develop or script their own. user interface components. For example, standard HTML controls already meet this success. criterion when used according to specification. ",
  "children": [],
  "secno": "4.1.2 ",
  "depth": 2
},
{
  "link_name": "4.1.3 Status Messages",
  "link_href": "#status-messages",
  "section_text": "Success Criterion 4.1.3 Status Messages> Understanding Status Messages | How to Meet Status Messages(Level AA). In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus. ",
  "children": [],
  "secno": "4.1.3 ",
  "depth": 2
}
],
"secno": "4.1 ",
"depth": 1
  }
],
"secno": "4. ",
"depth": 0
},
{
"link_name": "5. Conformance",
"link_href": "#conformance",
"section_text": "5. Conformance> This section lists requirements for conformance to WCAG 2.1. It also gives information about how to make conformance claims, which are optional. Finally, it describes what it means to be accessibility supported, since only accessibility-supported ways of using technologies can be relied upon for conformance. Understanding Conformance includes further explanation of the accessibility-supported concept. 5.1 Interpreting Normative Requirements> The main content of WCAG 2.1 is normative and defines requirements that impact conformance claims. Introductory material, appendices, sections marked as non-normative, diagrams, examples, and notes are informative (non-normative). Non-normative material provides advisory information to help interpret the guidelines but does not create requirements that impact a conformance claim. The key words MAY, MUST, MUST NOT, NOT RECOMMENDED, RECOMMENDED, SHOULD, and SHOULD NOT are to be interpreted as described in [RFC2119]. 5.2 Conformance Requirements> In order for a Web page to conform to WCAG 2.1, all of the following conformance requirements must be satisfied: 5.2.1 Conformance Level> One of the following levels of conformance is met in full. For Level A conformance (the minimum level of conformance), the Web page. satisfies all the Level A Success Criteria, or a conforming alternate version is provided. For Level AA conformance, the Web page satisfies all the Level A and Level AA Success Criteria, or a Level AA conforming alternate version is provided. For Level AAA conformance, the Web page satisfies all the Level A, Level AA and Level AAA Success Criteria, or a Level AAA conforming alternate version is provided. NoteAlthough conformance can only be achieved at the stated levels, authors are encouraged to report (in their claim) any progress toward meeting success criteria from all levels beyond the achieved level of conformance. NoteIt is not recommended that Level AAA conformance be required as a general policy for entire sites because it is not possible to satisfy all Level AAA Success Criteria for some content. 5.2.2 Full pages> Conformance (and conformance level) is for full Web page(s) only, and cannot be achieved if part of a Web page is excluded. NoteFor the purpose of determining conformance, alternatives to part of a page's content are considered part of the page when the alternatives can be obtained directly from the page, e.g., a long description or an alternative presentation of a video. NoteAuthors of Web pages that cannot conform due to content outside of the author's control may consider a Statement of Partial Conformance. NoteNew A full page includes each variation of the page that is automatically presented by the page for various screen sizes (e.g. variations in a responsive Web page). Each of these variations needs to conform (or needs to have a conforming alternate version) in order for the entire page to conform. 5.2.3 Complete processes> When a Web page is one of a series of Web pages presenting a process (i.e., a sequence of steps that need to be completed in order to accomplish an activity), all Web pages in the process conform at the specified level or better. (Conformance is not possible at a particular level if any page in the process does not conform at that level or better.). An online store has a series of pages that are used to select and purchase products. All pages in the series from start to finish (checkout) conform in order for any page that is part of the process to conform. 5.2.4 Only Accessibility-Supported Ways of Using Technologies> Only accessibility-supported ways of using technologies are relied upon to satisfy the success criteria. Any information or functionality that is provided in a way that is not accessibility supported is also available in a way that is accessibility supported. (See Understanding accessibility support.) . 5.2.5 Non-Interference> If  technologies  are used in a way that is not accessibility supported, or if they are used in a non-conforming way, then they do not block the ability of users to access the rest of the page. In addition, the Web page as a whole continues to meet the conformance requirements under each of the following conditions: when any technology that is not relied upon is turned on in a user agent,. when any technology that is not relied upon is turned off in a user agent, and. when any technology that is not relied upon is not supported by a user agent In addition, the following success criteria apply to all content on the page, including content that is not otherwise relied upon to meet conformance, because failure to meet them could interfere with any use of the page: 1.4.2 - Audio Control,. 2.1.2 - No Keyboard Trap,. 2.3.1 - Three Flashes or Below Threshold, and. 2.2.2 - Pause, Stop, Hide. NoteIf a page cannot conform (for example, a conformance test page or an example page), it cannot be included in the scope of conformance or in a conformance claim. For more information, including examples, see Understanding Conformance Requirements.  5.3 Conformance Claims (Optional) > Conformance is defined only for Web pages. However, a conformance claim may be made to cover one page, a series of pages, or multiple related Web pages. 5.3.1 Required Components of a Conformance Claim> Conformance claims are not required. Authors can conform to WCAG 2.1 without making a claim. However, if a conformance claim is made, then the conformance claim must include the following information: Date of the claim. Guidelines title, version and URI  Web Content Accessibility Guidelines 2.1 at https://www.w3.org/TR/WCAG21/ In WCAG 2.0 this was a dated URI, which may need to be adjusted when this becomes a Rec. Conformance level satisfied: (Level A, AA or AAA) A concise description of the Web pages, such as a list of URIs for which the claim is made, including whether subdomains are included in the claim. NoteThe Web pages may be described by list or by an expression that describes all of the URIs included in the claim. NoteWeb-based products that do not have a URI prior to installation on the customer's Web site may have a statement that the product would conform when installed. A list of the . Web content technologies. relied upon. NoteIf a conformance logo is used, it would constitute a claim and must be accompanied by the required components of a conformance claim listed above. 5.3.2 Optional Components of a Conformance Claim > In addition to the required components of a conformance claim above, consider providing additional information to assist users. Recommended additional information includes: A list of success criteria beyond the level of conformance claimed that have been met. This information should be provided in a form that users can use, preferably machine-readable metadata. A list of the specific technologies that are  used but not relied upon. A list of user agents, including assistive technologies that were used to test the content. A list of specific accessibility characteristics of the content, provided in machine-readable metadata. Information about any additional steps taken that go beyond the success criteria to enhance accessibility. A machine-readable metadata version of the list of specific technologies that are relied upon. A machine-readable metadata version of the conformance claim. NoteRefer to Understanding Conformance Claims for more information and example conformance claims. NoteRefer to Understanding Metadata for more information about the use of metadata in conformance claims.  5.4 Statement of Partial Conformance - Third Party Content> Sometimes, Web pages are created that will later have additional content added to them. For example, an email program, a blog, an article that allows users to add comments, or applications supporting user-contributed content. Another example would be a page, such as a portal or news site, composed of content aggregated from multiple contributors, or sites that automatically insert content from other sources over time, such as when advertisements are inserted dynamically. In these cases, it is not possible to know at the time of original posting what the uncontrolled content of the pages will be. It is important to note that the uncontrolled content can affect the accessibility of the controlled content as well. Two options are available: . A determination of conformance can be made based on best knowledge. If a page of this type is monitored and repaired (non-conforming content is removed or brought into conformance) within two business days, then a determination or claim of conformance can be made since, except for errors in externally contributed content which are corrected or removed when encountered, the page conforms. No conformance claim can be made if it is not possible to monitor or correct non-conforming content;. OR . A statement of partial conformance may be made that the page does not conform, but could conform if certain parts were removed. The form of that statement would be, This page does not conform, but would conform to WCAG 2.1 at level X if the following parts from uncontrolled sources were removed. In addition, the following would also be true of uncontrolled content that is described in the statement of partial conformance: It is not content that is under the author's control. It is described in a way that users can identify (e.g., they cannot be described as all parts that we do not control unless they are clearly marked as such.)   5.5 Statement of Partial Conformance - Language> A statement of partial conformance due to language may be made when the page does not conform, but would conform if accessibility support existed for (all of) the language(s) used on the page. The form of that statement would be, This page does not conform, but would conform to WCAG 2.1 at level X if accessibility support existed for the following language(s): ",
"children": [
  {
"link_name": "5.1 Interpreting Normative Requirements",
"link_href": "#interpreting-normative-requirements",
"section_text": "5.1 Interpreting Normative Requirements> The main content of WCAG 2.1 is normative and defines requirements that impact conformance claims. Introductory material, appendices, sections marked as non-normative, diagrams, examples, and notes are informative (non-normative). Non-normative material provides advisory information to help interpret the guidelines but does not create requirements that impact a conformance claim. The key words MAY, MUST, MUST NOT, NOT RECOMMENDED, RECOMMENDED, SHOULD, and SHOULD NOT are to be interpreted as described in [RFC2119]. ",
"children": [],
"secno": "5.1 ",
"depth": 1
  },
  {
"link_name": "5.2 Conformance Requirements",
"link_href": "#conformance-reqs",
"section_text": "5.2 Conformance Requirements> In order for a Web page to conform to WCAG 2.1, all of the following conformance requirements must be satisfied: 5.2.1 Conformance Level> One of the following levels of conformance is met in full. For Level A conformance (the minimum level of conformance), the Web page. satisfies all the Level A Success Criteria, or a conforming alternate version is provided. For Level AA conformance, the Web page satisfies all the Level A and Level AA Success Criteria, or a Level AA conforming alternate version is provided. For Level AAA conformance, the Web page satisfies all the Level A, Level AA and Level AAA Success Criteria, or a Level AAA conforming alternate version is provided. NoteAlthough conformance can only be achieved at the stated levels, authors are encouraged to report (in their claim) any progress toward meeting success criteria from all levels beyond the achieved level of conformance. NoteIt is not recommended that Level AAA conformance be required as a general policy for entire sites because it is not possible to satisfy all Level AAA Success Criteria for some content. 5.2.2 Full pages> Conformance (and conformance level) is for full Web page(s) only, and cannot be achieved if part of a Web page is excluded. NoteFor the purpose of determining conformance, alternatives to part of a page's content are considered part of the page when the alternatives can be obtained directly from the page, e.g., a long description or an alternative presentation of a video. NoteAuthors of Web pages that cannot conform due to content outside of the author's control may consider a Statement of Partial Conformance. NoteNew A full page includes each variation of the page that is automatically presented by the page for various screen sizes (e.g. variations in a responsive Web page). Each of these variations needs to conform (or needs to have a conforming alternate version) in order for the entire page to conform. 5.2.3 Complete processes> When a Web page is one of a series of Web pages presenting a process (i.e., a sequence of steps that need to be completed in order to accomplish an activity), all Web pages in the process conform at the specified level or better. (Conformance is not possible at a particular level if any page in the process does not conform at that level or better.). An online store has a series of pages that are used to select and purchase products. All pages in the series from start to finish (checkout) conform in order for any page that is part of the process to conform. 5.2.4 Only Accessibility-Supported Ways of Using Technologies> Only accessibility-supported ways of using technologies are relied upon to satisfy the success criteria. Any information or functionality that is provided in a way that is not accessibility supported is also available in a way that is accessibility supported. (See Understanding accessibility support.) . 5.2.5 Non-Interference> If  technologies  are used in a way that is not accessibility supported, or if they are used in a non-conforming way, then they do not block the ability of users to access the rest of the page. In addition, the Web page as a whole continues to meet the conformance requirements under each of the following conditions: when any technology that is not relied upon is turned on in a user agent,. when any technology that is not relied upon is turned off in a user agent, and. when any technology that is not relied upon is not supported by a user agent In addition, the following success criteria apply to all content on the page, including content that is not otherwise relied upon to meet conformance, because failure to meet them could interfere with any use of the page: 1.4.2 - Audio Control,. 2.1.2 - No Keyboard Trap,. 2.3.1 - Three Flashes or Below Threshold, and. 2.2.2 - Pause, Stop, Hide. NoteIf a page cannot conform (for example, a conformance test page or an example page), it cannot be included in the scope of conformance or in a conformance claim. For more information, including examples, see Understanding Conformance Requirements. ",
"children": [
{
  "link_name": "5.2.1 Conformance Level",
  "link_href": "#cc1",
  "section_text": "5.2.1 Conformance Level> One of the following levels of conformance is met in full. For Level A conformance (the minimum level of conformance), the Web page. satisfies all the Level A Success Criteria, or a conforming alternate version is provided. For Level AA conformance, the Web page satisfies all the Level A and Level AA Success Criteria, or a Level AA conforming alternate version is provided. For Level AAA conformance, the Web page satisfies all the Level A, Level AA and Level AAA Success Criteria, or a Level AAA conforming alternate version is provided. NoteAlthough conformance can only be achieved at the stated levels, authors are encouraged to report (in their claim) any progress toward meeting success criteria from all levels beyond the achieved level of conformance. NoteIt is not recommended that Level AAA conformance be required as a general policy for entire sites because it is not possible to satisfy all Level AAA Success Criteria for some content. ",
  "children": [],
  "secno": "5.2.1 ",
  "depth": 2
},
{
  "link_name": "5.2.2 Full pages",
  "link_href": "#cc2",
  "section_text": "5.2.2 Full pages> Conformance (and conformance level) is for full Web page(s) only, and cannot be achieved if part of a Web page is excluded. NoteFor the purpose of determining conformance, alternatives to part of a page's content are considered part of the page when the alternatives can be obtained directly from the page, e.g., a long description or an alternative presentation of a video. NoteAuthors of Web pages that cannot conform due to content outside of the author's control may consider a Statement of Partial Conformance. NoteNew A full page includes each variation of the page that is automatically presented by the page for various screen sizes (e.g. variations in a responsive Web page). Each of these variations needs to conform (or needs to have a conforming alternate version) in order for the entire page to conform. ",
  "children": [],
  "secno": "5.2.2 ",
  "depth": 2
},
{
  "link_name": "5.2.3 Complete processes",
  "link_href": "#cc3",
  "section_text": "5.2.3 Complete processes> When a Web page is one of a series of Web pages presenting a process (i.e., a sequence of steps that need to be completed in order to accomplish an activity), all Web pages in the process conform at the specified level or better. (Conformance is not possible at a particular level if any page in the process does not conform at that level or better.). An online store has a series of pages that are used to select and purchase products. All pages in the series from start to finish (checkout) conform in order for any page that is part of the process to conform. ",
  "children": [],
  "secno": "5.2.3 ",
  "depth": 2
},
{
  "link_name": "5.2.4 Only Accessibility-Supported Ways of Using Technologies",
  "link_href": "#cc4",
  "section_text": "5.2.4 Only Accessibility-Supported Ways of Using Technologies> Only accessibility-supported ways of using technologies are relied upon to satisfy the success criteria. Any information or functionality that is provided in a way that is not accessibility supported is also available in a way that is accessibility supported. (See Understanding accessibility support.). ",
  "children": [],
  "secno": "5.2.4 ",
  "depth": 2
},
{
  "link_name": "5.2.5 Non-Interference",
  "link_href": "#cc5",
  "section_text": "5.2.5 Non-Interference> If  technologies  are used in a way that is not accessibility supported, or if they are used in a non-conforming way, then they do not block the ability of users to access the rest of the page. In addition, the Web page as a whole continues to meet the conformance requirements under each of the following conditions: when any technology that is not relied upon is turned on in a user agent,. when any technology that is not relied upon is turned off in a user agent, and. when any technology that is not relied upon is not supported by a user agent In addition, the following success criteria apply to all content on the page, including content that is not otherwise relied upon to meet conformance, because failure to meet them could interfere with any use of the page: 1.4.2 - Audio Control,. 2.1.2 - No Keyboard Trap,. 2.3.1 - Three Flashes or Below Threshold, and. 2.2.2 - Pause, Stop, Hide. NoteIf a page cannot conform (for example, a conformance test page or an example page), it cannot be included in the scope of conformance or in a conformance claim. For more information, including examples, see Understanding Conformance Requirements. ",
  "children": [],
  "secno": "5.2.5 ",
  "depth": 2
}
],
"secno": "5.2 ",
"depth": 1
  },
  {
"link_name": "5.3 Conformance Claims (Optional) ",
"link_href": "#conformance-claims",
"section_text": "5.3 Conformance Claims (Optional) > Conformance is defined only for Web pages. However, a conformance claim may be made to cover one page, a series of pages, or multiple related Web pages. 5.3.1 Required Components of a Conformance Claim> Conformance claims are not required. Authors can conform to WCAG 2.1 without making a claim. However, if a conformance claim is made, then the conformance claim must include the following information: Date of the claim. Guidelines title, version and URI  Web Content Accessibility Guidelines 2.1 at https://www.w3.org/TR/WCAG21/ In WCAG 2.0 this was a dated URI, which may need to be adjusted when this becomes a Rec. Conformance level satisfied: (Level A, AA or AAA) A concise description of the Web pages, such as a list of URIs for which the claim is made, including whether subdomains are included in the claim. NoteThe Web pages may be described by list or by an expression that describes all of the URIs included in the claim. NoteWeb-based products that do not have a URI prior to installation on the customer's Web site may have a statement that the product would conform when installed. A list of the . Web content technologies. relied upon. NoteIf a conformance logo is used, it would constitute a claim and must be accompanied by the required components of a conformance claim listed above. 5.3.2 Optional Components of a Conformance Claim > In addition to the required components of a conformance claim above, consider providing additional information to assist users. Recommended additional information includes: A list of success criteria beyond the level of conformance claimed that have been met. This information should be provided in a form that users can use, preferably machine-readable metadata. A list of the specific technologies that are  used but not relied upon. A list of user agents, including assistive technologies that were used to test the content. A list of specific accessibility characteristics of the content, provided in machine-readable metadata. Information about any additional steps taken that go beyond the success criteria to enhance accessibility. A machine-readable metadata version of the list of specific technologies that are relied upon. A machine-readable metadata version of the conformance claim. NoteRefer to Understanding Conformance Claims for more information and example conformance claims. NoteRefer to Understanding Metadata for more information about the use of metadata in conformance claims. ",
"children": [
{
  "link_name": "5.3.1 Required Components of a Conformance Claim",
  "link_href": "#conformance-required",
  "section_text": "5.3.1 Required Components of a Conformance Claim> Conformance claims are not required. Authors can conform to WCAG 2.1 without making a claim. However, if a conformance claim is made, then the conformance claim must include the following information: Date of the claim. Guidelines title, version and URI  Web Content Accessibility Guidelines 2.1 at https://www.w3.org/TR/WCAG21/ In WCAG 2.0 this was a dated URI, which may need to be adjusted when this becomes a Rec. Conformance level satisfied: (Level A, AA or AAA) A concise description of the Web pages, such as a list of URIs for which the claim is made, including whether subdomains are included in the claim. NoteThe Web pages may be described by list or by an expression that describes all of the URIs included in the claim. NoteWeb-based products that do not have a URI prior to installation on the customer's Web site may have a statement that the product would conform when installed. A list of the . Web content technologies. relied upon. NoteIf a conformance logo is used, it would constitute a claim and must be accompanied by the required components of a conformance claim listed above. ",
  "children": [],
  "secno": "5.3.1 ",
  "depth": 2
},
{
  "link_name": "5.3.2 Optional Components of a Conformance Claim ",
  "link_href": "#conformance-optional",
  "section_text": "5.3.2 Optional Components of a Conformance Claim > In addition to the required components of a conformance claim above, consider providing additional information to assist users. Recommended additional information includes: A list of success criteria beyond the level of conformance claimed that have been met. This information should be provided in a form that users can use, preferably machine-readable metadata. A list of the specific technologies that are  used but not relied upon. A list of user agents, including assistive technologies that were used to test the content. A list of specific accessibility characteristics of the content, provided in machine-readable metadata. Information about any additional steps taken that go beyond the success criteria to enhance accessibility. A machine-readable metadata version of the list of specific technologies that are relied upon. A machine-readable metadata version of the conformance claim. NoteRefer to Understanding Conformance Claims for more information and example conformance claims. NoteRefer to Understanding Metadata for more information about the use of metadata in conformance claims. ",
  "children": [],
  "secno": "5.3.2 ",
  "depth": 2
}
],
"secno": "5.3 ",
"depth": 1
  },
  {
"link_name": "5.4 Statement of Partial Conformance - Third Party Content",
"link_href": "#conformance-partial",
"section_text": "5.4 Statement of Partial Conformance - Third Party Content> Sometimes, Web pages are created that will later have additional content added to them. For example, an email program, a blog, an article that allows users to add comments, or applications supporting user-contributed content. Another example would be a page, such as a portal or news site, composed of content aggregated from multiple contributors, or sites that automatically insert content from other sources over time, such as when advertisements are inserted dynamically. In these cases, it is not possible to know at the time of original posting what the uncontrolled content of the pages will be. It is important to note that the uncontrolled content can affect the accessibility of the controlled content as well. Two options are available: . A determination of conformance can be made based on best knowledge. If a page of this type is monitored and repaired (non-conforming content is removed or brought into conformance) within two business days, then a determination or claim of conformance can be made since, except for errors in externally contributed content which are corrected or removed when encountered, the page conforms. No conformance claim can be made if it is not possible to monitor or correct non-conforming content;. OR . A statement of partial conformance may be made that the page does not conform, but could conform if certain parts were removed. The form of that statement would be, This page does not conform, but would conform to WCAG 2.1 at level X if the following parts from uncontrolled sources were removed. In addition, the following would also be true of uncontrolled content that is described in the statement of partial conformance: It is not content that is under the author's control. It is described in a way that users can identify (e.g., they cannot be described as all parts that we do not control unless they are clearly marked as such.)  ",
"children": [],
"secno": "5.4 ",
"depth": 1
  },
  {
"link_name": "5.5 Statement of Partial Conformance - Language",
"link_href": "#conformance-partial-lang",
"section_text": "5.5 Statement of Partial Conformance - Language> A statement of partial conformance due to language may be made when the page does not conform, but would conform if accessibility support existed for (all of) the language(s) used on the page. The form of that statement would be, This page does not conform, but would conform to WCAG 2.1 at level X if accessibility support existed for the following language(s):. ",
"children": [],
"secno": "5.5 ",
"depth": 1
  }
],
"secno": "5. ",
"depth": 0
}
  ]
}
